<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>برمج و شارك<br />
</strong>إبتداءً من الإصدارة 2.0 من phpTransformer أصبح المبرمجون و المصممون و المترجمون شركاء في نجاحنا فيمكنهم المساعدة عبر ارسال عملهم لنا و نحن بدورنا سنقوم بإدراج أعمالهم في متجر التطبيقات الذي سيكون متوفراً ابتداءً من الاصدارة 2.5 , الشرط الأساسي لقبول العمل هو ان يكون حر مفتوح المصدر , نحن نحتفظ بكامل حقك كمالك لعملك كما يمكنك الحصول على مردود مالي منه.</p>
<p>الإسم : إسمك الثلاثي الكامل.<br />
  بريد إلكتروني : بريدك الذي سيظهر مع اعمالك, من الافضل ان يكون لديك بريد خاص للعمل منفصل عن بريدك الخاص.<br />
الشركة أو المؤسسة أو الجمعية : إذا كنت تنتمي لاي من الذي سبق ذكره يمكن ذكره و إلا اتركه فارغاً .<br />
الهاتف: اذا كنت من خارج لبنان لا تنسى ان تضيف رمز البلد و رمز المحلة التي تسكنها.<br />
العنوان : عنوانك الكامل يفيدك للزبائن المحليين كي يتواصلوا معك.<br />
معلومات الإصدار : يمكنك هنا كتابة شرح بسيط و مفيد لعملك .<br />
رابط المشاركة: من هنا سنتمكن من الحصول على عملك لدارسته و ادراجه ضمن متجر التطبيقات, رجاءً لا تقم بارسال رابط يتطلب كلمة سر .<br />
نوع المشاركة : من هنا يمكنك اختيار نوع عملك حسب تصنيف phpTransformer .<br />
مفتوح المصدر: في حال لم يكن عملك يخضع لأي من الإتفاقيات الحرة المفتوحة المصدر , رجاءً لا تقم ترسله لنا, نحن نؤمن بمبدأ و نعمل تحت سقفه, تمتاز البرمجيات الحرة المفتوحة بـ :</p>
<ul>
  <li>أن يتمكن اي انسان من الحصول عليها.</li>
  <li>أن يستطيع تعلم كيفية عملها و كيف يعمل عليها.</li>
  <li>أن يستطيع تعديلها و تطويرها.</li>
  <li>أن تسمح له بإعادة نشهرها و مشاركتها مع الجميع. </li>
</ul>
<p>هذا لا يعني انه لا يمكنك الحصول على بدل مادي لعمل بل على العكس نحن نجد أن البرمجيات الحرة هي افضل وسيلة اخلاقية للحصول على نفقات الحياة الضرورية. </p>
<p>الرسالة: تستطيع كتابة ما تريد هنا من استفسارات و طلبات و بنود لم يتم ذكرها فيما سبق.</p>