<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>أشكال الموقع<br />
  </strong> الجميل أنه بإستطاعتك تغيير شكل موقعك بكبسة زر واحدة عبر تفعيل شكل معين , كما يمكن للأعضاء تحديد الشكل الذي يفضلوه من لوحة تحكمهم الخاصة تبعاً لما تفعله من هنا من أشكال.

</p>
<p>الأشكال المفعلة:<br />
هي الاشكال التي تم اعتمادها من قبل مدير الموقع و يستطيع الزوار استخدامها من لوحة تحكمهم.<br />
الشكل: هو الاسم اللاتيني لمجلد الشكل.<br />
أختير : عدد المرات التي تم استعمال هذا الشكل من قبل الزوار.<br />
ترخيص : هنا يمكنك ادخال مفتاح الترخيص لهذا الشكل او تعديله.<br />
معاينة: من خلال هذا الرابط يمكنك مشاهدة الموقع بهذا الشكل.<br />
حذف : يتم حذف الشكل و بذلك يمنع استخدامه من قبل الزوار, الحذف هنا هو تحويل الشكل الى سلة المحذوفات حيث يمكنك استراجعه و حذفه بشكل نهائي. عملية الحذف هي عملية حذف التفعيل, لكن اذا اردت ان تحذف الملفات الخاصة بهذا الشكل , فعليك حذفهم من خلال &quot; ملفات الموقع &quot;
من الصفحة الرئيسية للوحة تحكم المدير.</p>
<p>شكل جديد:<br />
يتم في هذه الشاشة عرض الاشكال التي سبق و تم رفعها الى الموقع أو أتت بشكل افتراضي مع النسخة الحالية, يتم عرض صورة مصغرة للموقع و تحتها رابط التفعيل لهذا الشكل, كما يدرج تحتهم معلومات عن هذا الشكل مثل اسم الشكل و الموقع الرسمي له و شرح بسيط عنه و المصمم لهذا الشكل و رقم اصداره و بعض الكلمات المفتاحية عنه.</p>