<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>المعرض :</strong></p>
<p> المعرض هو تطبيق الوسائط المتعددة و الكتب, في هذا التطبيق يمكنك ادارة الملفات السمعية و الصور و الفيديو و الكتب و الملفات على مختلف انواعها, مع تحديد معلومات عنها كالعنوان و المكان و الشرح و الكلمات المفتاحية للبحث عنه, و ايضا التعليقات من الزوار عليه.</p>
<p>إستعراض الكل : هنا تظهر الملفات حسب ترتيبها داخل المجلدات في uploads/gallery/Albums في الأعلى ستجد المجلدات الفرعية و عند كبسها سيأخذك الرابط الى محتويات هذا المجلد و هلما جرى.<br />
  عند وجود ملفات دخل أي مجلد سيظهر لك ايوقنة قربه و فيها علامة صح اذا تم اضافة هذا الملف لقاعدة البيانات و بالتالي للظهور للزوار, و قربها اسم الملف و عنوانه الذي أخذه حسب اللغة المعروضة حالياً و شرح و مكتنه أيضا, كما ستجد تاريخه, و عدد الزيارات لهذا الملف.<br />
  على نفس آخر السطر ستجد أيقوانات , الزائد لإضافة هذا الملف و بالونات للتعليقات على هذا الملف و التحرير لتعديل معلومات الملف و ايقونة الحذف له من قاعدة البيانات .<br />
  ملاحظة : كي تقوم بحذف الملف نهائيا من الموقع يجب أن تحذفه من &quot; ملفات الموقع&quot; عبر الشاشة الرئيسية للمدير.<br />
في إسفل معلومات الملفات ستجد طرق إجراء عمليات سريعة مثل انتقاء جميع الملفات و نزع الانتقاء عن الكل, و حذف كل الملفات التي تم اضافتها أو اضافتها الى قاعدة البيانات.</p>
<p>خيارات المعرض : يقوم تطبيق المعرض في phpTransformer بعرض الملفات للزائر كمصغرات يتم تكبيرها قليلا عند تمرير مؤشر الفأرة عليها اذا كانت صور , هذه المصغرات يتم صفها بأعمدة, و يتم تحديد كول و عرض المصغرات الأقصى من هنا, كما يتم تحديد عدد الأعمدة , و خيار اذا كنت تريد اظهار اسم الملف الحقيقي على الزوار .</p>
<p>تنظيف البيانات: في بعض الحالات قد يقوم المدير بحذف الملفات فعلا من على الموقع عبر برامج أخرى مثل ftp او تطبيق &quot; ملفات الموقع &quot; لذلك ستظهر المعلومات للزائر لكن الملفات ستكون غير موجودة, لذلك عند كبس هذا الرابط سيقوم التطبيق بتفقد كل الملفات الغير موجودة فعلا و حذفها من قاعدة البيانات.</p>
