<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>صلاحيات البرنامج<br />
  </strong>صحيح أن عالم الإنترنت هو عالم معلومات مفتوح للجميع, لكن أحياناً هناك برامج ترغب في تخصيص الوصول اليها لأشخاص محددين كلوائح أسعار منتوجاتك مثلا, لذلك تم إنشاء صلاحيات لكل برنامج يطبق السماح و المنع عليه حسب مجموعة معينة من الاعضاء.
</p>
<p>يمكنك تحديد الصلاحية للوصول الى البرنامج الذي قمت باختياره و كبس زر أرسل حسب المجموعات التي سبق و أن قمت بادخالها مسبقاً أو حسب الثلاث مجموعات التي تأتي مع phpTransformer بشكل إفتراضي, أول خيار ستجده هو باقي الاعضاء أي الاعضاء الذي لا ينتمون الى المجموعات المدرجة تحتها, عندما تختار نعم فذلك يعني أن اعضاء هذه المجموعة سيتمكنوا من الوصول الى هذا البرنامج و العكس صحيح.</p>