<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>صلاحيات البلوك<br />
  </strong>هناك بلوكات يجب حصر الوصول اليها لمجموعة معين من الأعضاء و يجب تطبيق صلاحيات عليها, مثل نحن في موقعنا الرسمي وضعنا بلوك الشركاء محصوراً بالاعضاء المسجلين لدينا و لا يظهر لجميع الزوار.</p>
<p>يمكنك تحديد الصلاحية للوصول الى البلوك الذي قمت باختياره و كبس زر أرسل حسب المجموعات التي سبق و أن قمت بادخالها مسبقاً أو حسب الثلاث مجموعات التي تأتي مع phpTransformer بشكل إفتراضي, أول خيار ستجده هو باقي الاعضاء أي الاعضاء الذي لا ينتمون الى المجموعات المدرجة تحتها, عندما تختار نعم فذلك يعني أن اعضاء هذه المجموعة سيتمكنوا من رؤية  هذا البلوك و العكس صحيح.</p>