<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>ملفات الموقع<br />
  </strong>يتميز phpTransformer بوجود مدير ملفات مدمج فيه يتم عبر إدارة جميع ملفات الموقع دون إستثناء كما يمكنك التعامل مع الملفات بالرفع و التنزيل و ايضا ضغط الملفات و نقلها و نسخها و حذفها و تطبيق صلاحيات وصول عليها مما يقلل من نسبة الحاجة الى الدخول للوحة تحكم استضافة الموقع بشكل كبير.
</p>
<p>العملية سهلة للغاية مثل معظم برامج ادارة ملفات انظمة التشغيل.</p>
<p>نحن ننصح أن يتمكن من الوصول الى ملفات الموقع فقط المدير آدم لدواعي أمنية.</p>