<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>إدارة بلوك<br />
  </strong>البلوكات هي  عبارة عن برمجيات صغيرة الحجم تظهر عادة للزائر على يمين و يسار الصفحة ضمن أعمدة مخصصة  لها , من خلال هذه الأيقونة يمكن انتقاء البلوك الذي تريده و تقوم بمهام يوفرها  مطور هذا البلوك مثل التحرير و الحذف و الإضافة و الحفظ .
</p>
<p>يتم العرض في هذه الصفحة أيقونات للبلوكات التي تم تفعيلها, و تحت كل أيقونة يوجد رابط فيه اسم البلوك و رقم اصداره, أسفل هذا الرابط يوجد شرح لترخيص الدعم الفني الخاص به و باول السطر تجد أيقونة صغيرة تكون علامة صح إذا تم توثيق مفتاح الترخيص و تظهر علامة معلومات إذا لم تقم بعد بطلب ترخيص و تظهر علامة خطأ صفراء في حال كان هناك خطأ بالتوثيق, و أسفل هذا السطر بالخط العريض يوجد شرح لعمل هذا البلوك.</p>
<p>&nbsp;</p>