<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>صفحات الخطأ<br />
  </strong>في العادة عند وجود خطأ ما باستعراض الموقع مثل عدم وجود الصفحة المطلوبة أو مجلد يمنع الوصول اليه يظهر خادم Apache رسائل الخاصة به, لكن من هنا يمكنك وضع صفحة تظهر بمظهر جميل مع رسالة واضحة و حتى يمكنك استثمارها في الاعلانات مثلا.
</p>
<p>على يمين الشاشة تجد الخطأ المدعوم و على يمينه تصميم الصفحة التي شتظهر للزائر, يمكنك تحريها و حفظها و استخدام وسوم html فيها.</p>