<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong> الصفحات<br />
  </strong>تم وضع أيقونة  تطبيق الصفحات في الصفحة الرئيسية للمدير لتسهيل الوصول إليها, لأنه يحتاجها بشكل شبه يومي.
</p>
<p>تطبيق الصفحات يعمل على إنشاء صفحات للموقع مرقمة بالتتالي و يتم الربط فيما بينها عبر اللائحة الرئيسية, كما يمكن الربط بينها بشكل يدوي .<br />
  مثال عن رابط لصفحة رقم 3 و باللغة العربية في موقع تم تفعيل خيار صداقة محركات البحث (الخيار الإفتراضي):<br />
Prog-pages_pagenbr-3_Lang-Arabic_nl-1.pt<br />
مثال عن رابط لصفحة رقم 3 و باللغة العربية في موقع لم يتم فيه تفعيل خيار صداقة محركات البحث:index.php?Prog=pages&amp;pagenbr=3&amp;Lang=Arabic&amp;nl=1<br />
يجب ان تأخذ بالحسبان أن حالة الأحرف حساسة و الحرف الكبير يجب أن يكون كذلك و الا فقدت الوصول للصفحة المطلوبة.</p>
<p>عنوان الصفحة : هو العنوان الذي سيظهر في أعلى شريط المستعرض و كمان انه سيظهر ضمن اللائحة المنسدلة و في شريط التنقل في أعلى البرامج و أيضا هذا العنوان سيظهر كملحق في الروابط الأوتوماتيكة في الموقع في حالة تفعيل صداقة محركات البحث.</p>
<p>رقم الصفحة: هو رقم فريد لكل صفحة تتميز بها عن غيرها, من الممكن ان يتكرر عنوان الصفحة لكن لا يمكن تكرار رقم الصفحة, هذا الرقم يتم ترتيبه الجديد من أعلى و القديم من اسفل في لوحة تحكم المدير.</p>
<p>صفحة جديدة: عند قيامك بانشاء صفحة جديدة تظهر في لوحة التحكم شاشة جديدة فيها عنوان الصفحة و مضمونها مجمعة حسب كل لغة يدعمها الموقع, لذلك عليك تعبئة كل لغة ببيانتها في الاغلب تكون ترجمة للغة الاساسية, عند طلب الزائر للصفحة بلغة غير مدعومة ستظهر له رسلة خطأ أن هذه الصفحة بهذه اللغة غير متوفرة.<br />
  مضمون الصفحة تم إغناؤه بسكربت من أجل تسهيل ادخال المعلومات كما هو الحال مع باقي برامج تحرير النصوص, كما يمكن استعراض كود HTML المنجز داخل الصفحة, عند ادخالك وسائط متعددة داخل الصفحة مثل الصور و الصوت و الفيديو تزكر أن رابط هذه الوسائط يجب ان يكون متوفر أونلاين للزائر ,لذلك ننصح دائما بنسخ هذه الوسائط الى مجلدات الموقع حتى لا يتم فقدها فيما بعد.<br />
أيضا لتسهيل المهمة على مستخدمي تطبيق MS Office Word و الذين يريدون لصق المعلومات منه يمكنهم استخدام زر اللصق من w بحيث يتم تجاهل بعض الكودات الغير قياسية مع لغة المواقع و تظهر الكتابة بشكل أجمل.<br />
أيضا يمكنك اختيار صح في &quot; إضافة عنوان هذه الصفحة الى الائحة الرئيسية &quot; حتى يتم ادراج هذه الصفحة بشكل اتوماتيكي .</p>
<p>التعديل: يطبق جميع ما ذكر في الصفحة الجيدة لكن من دون توفر خاصية الادراج في اللائحة الرئيسية لمنع التكرار.</p>
<p>الحذف : عند كبس حذف يتم اخطارك بأنه سوف يتم الحذف , في حال كانت الصفحة محذوفة لن يتمكن الزوار من الوصول اليها و سوف يتم تحويلها الى سلة المحذوفات حيث يمكنك استعادتها من هناك او حذفها بشكل نهائي.</p>
<p>عند وجود عدد كبير من الصفحات , سيتم استعراضهم ضمن شاشات متعددة للترتيب و سهولة الوصول, على كل حال أجدد صفحة قمت بإدخالها سيتم أظهارها أولاً.</p>