<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
><strong>نظام التخزين المؤقت<br />
    </strong>سر سرعة phpTransformer هو بتوفيره هذا النظام, فمن المعلوم ان الوصول الى خادم قاعدة البيانات لجلب المعلومات به و من ثم معالجتها و اظهارها في مستعرض الانترنت تأخذ وقت قد يصل الى حدود 4 ثواني, لكن عند تفعيل نظام التخزين المؤقت نقوم بتخزين نسخة مضغوطة من الصفحة المطلوبة على القرص الصلب للموقع و في المرة التالية نقوم بعرض هذه الصفحة مباشرة للزائر مما يقلل وقت الانجاز الى حوالي 0.3 ثانية فقط.
<p>نظام التخزين المؤقت مفعل ؟ : اذا وضعت قيمة نعم فسيتم حفظ الصفحات كما هي الان و ستظهر للزوار مجمدة على هذا الشكل حتى تنتهي فترة التخزين المؤقت.</p>
<p>الوقت الافتراضي لحفظ الصفحات : الوقت الذي ستظل الصفحات مجمدة فيه.</p>
<p>تفريغ كامل محتوى نظام التخزين المؤقت : اذا قمت بتعديلات ضخمة في الموقع من الافضل تفريغ نظام التخزين المؤقت من كامل الصفحات المجمدة بداخله.</p>
<p>حذف صفحة من نظام التخزين المؤقت : اذا اردت حذف صفحة محددة دون سواها فيجب كتابة كامل عنوانها لان الحفظ يتم على اساس كامل عنوان الصفحة.</p>
<p>البرامج التي تدعم خاصية التخزين المؤقت : هنا يمكنك اي من البرامج يجب أن تخضع لنظام التخزين المؤقت, لا تقم باضافة برامج تستعمل خاصية Post لإرسال المعلومات و الا ظهرت دائما بشكل واحد.</p>
<p>لائحة العنواين التي سيتم تجاهلها في نظام التخزين المؤقت : قد تريد تشغيل نظام التخزين الؤقت على برنامج ما لك تريد استبعاد بعض الصفحات منه هنا يمكنك ادراج هذه الصفحات, ضع كل عنوان على سطر و اكبس زر Enter و من ثم حفظ لائحة التجاهل.</p>
