<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>لغات البلاد<br />
  </strong>يقوم phpTransformer بتحديد بلد الزائر عبر تفعيل هذه الخاصية من أيقونة الخيارات و بناءً عليه يتم عرض الموقع للزائر حسب لغة بلده المحددة هنا .
</p>
<p>لغة البلد: هي اللغة التي تريدها أن يظهره بها الموقع حينما يأتي من البلد المحدد باسم البلد.</p>
<p>اسم البلد: هو الاسم المتعارف عليه للبلد.</p>
<p>كود البلد: هو اختصار من حرفين متفق عليه عالميا لهذا البلد, في نهاية الجدول ستد بلد باسم بكود XX , تم اضافته لسبب ان بعض الـ IP غير مرتبطة ببلد محدد و هي تستخدم في شبكات الاتصال.</p>
<p>&nbsp;</p>