<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>أخطاء و تقارير<br />
</strong> إن معظم مدراء المواقع ليس بمبرمجين و يفضلوا قضاء معظم وقتهم في إدارة الموقع على حل المعضلات البرمجية لذلك قررنا وضع بند خاص في لوحة تحكم المدير يتم فيه تسجيل الاخطاء البرمجية و يتم ابلاغنا عنها عبر البريد الإلكتروني دون الحاجة لدخول لوحة تحكمك الخاصة مع الحفاظ على سرية عملك , كما يمكن لمدير الموقع أن يكتب تقرير خاص غير تلك المدرجة في الاخطاء البرمجية عبر موقع SourceForge.net الذي يستضيف مشروعنا.</p>
<p>ان ارسالك تقرير بالأخطاء لن يحسن من اداء موقعك فحسب بل يرشدنا الى تصليح هذه الاخطاء في الاصدارات القادمة, مبدأ المشاركة الذي نعمل به يجعل من تشارك الاخطاء بين الجميع و حل المشاكل يحسن من أداء و فعالية phpTransformer إصدار بعد إصدار.</p>
<p>أرسل تقرير : من المفترض عدم ظهور جدول بأخطاء في موقعك, لكن في حال ظهور بعض الاخطاء هنا, نرجو كبس زر أرسل تقرير, فيتم ارسال رسالة الينا بالخطأ مرفقة برابط لملف pdf فيه هذا الجدول.</p>
<p>حذف كل التسجيلات : عند تأكدك من حل المشاكل الظاهرة يمكن كبس هذا الزر لمحو السجل.</p>
<p>ملاحظة : لن يتم تسجيل الاخطاء في حال كانت قيمة $DisplayErrors في ملف config.php  هي yes و ستظهر رسائل الخطأ لزوار الموقع, هذه القيمة يتم تحديدها في أول عملية تنصيب للبرنامج.</p>