<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>اللائحة البريدية<br />
</strong>يوفر phpTransformer ميزة تواصل مع الأعضاء عبر لائحة بريدية يتم فيها تصميم نماذج رسائل يمكن استخدامها اكثر من مرة و يتم بعدها ارسالها لكل الأعضاء أو لأعضاء مجموعة معينة أو لعضو يمكن تحديده أو لبريد إلكتروني ما.</p>
<p>اللائحة البريدية:<br />
عند كبس زر الارسال سيقوم البرنامج بوضع علامة على كل عضو تم ارسال رسالة له , ذلك سينفع في حال انقطع الاتصال بالانترنت و اردت ان تعاود الارسال من جديد فلا يتم ارسال الرسالة مرتين, كما انه سيكون بمقدورك متابعة شريط يبين تقدم الارسال.</p>
<p>الرسائل:<br />
  قمنا بتطوير الرسائل لتكون مرنة في الاستعمال, فهناك رسائل نموذجية يتم استخدامها بشكل دائم مثل المناسبات و الاعياد و غيرها, نماذج الرسائل يمكن تعديلها و حذفها الى سلة المحذوفات و من ثم يمكنك استعادتها أو حذفها بشكل نهائي.<br />
  الرسائل تتمتع باختصارات تتغير قيمتها حسب المرسل اليه, مثلا عند ارسال الرسالة يتم استبدال المختصر {UserName}  الى اسم المستخدم الذي ستصله الرسالة .
</p>


ملاحظة : في حال الارسال الى مجموعة او لكل اعضاء الموقع فلن يتم ذكر اسم المستخدم في الرسالة و ذلك لتامين سرعة ارسال للرسائل عالية
