<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>إدارة برنامج<br />
  </strong>البرامج هي الجزء  الذي يظهر بمنتصف الصفحة للزائر و هي عبارة عن برنامج متكامل يدمج من ضمن أقسام <span dir="ltr">phpTransformer</span> ,  من خلال هذه الأيقونة يمكن انتقاء البرنامج الذي تريده و تقوم بمهام يوفرها مطور  هذا البرنامج مثل التحرير و الحذف و الإضافة و الحفظ .
</p>
<p>يتم العرض في هذه الصفحة أيقونات للبرامج التي تم تفعيلها, و تحت كل أيقونة يوجد رابط فيه اسم البرنامج و رقم اصداره, أسفل هذا الرباط يوجد شرح لترخيص الدعم الفني الخاص به و باول السطر تجد أيقونة صغيرة تكون علامة صح إذا تم توثيق مفتاح الترخيص و تظهر علامة معلومات إذا لم تقم بعد بطلب ترخيص و تظهر علامة خطأ صفراء في حال كان هناك خطأ بالتوثيق, و أسفل هذا السطر بالخط العريض يوجد شرح لعمل هذا البرنامج.</p>
<p>عند الكبس على الأيقونة أو الرابط ستذهب إلى إدارة البرنامج الذي اخترته.</p>
<p>&nbsp;</p>
</body>