<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong> الأخبار</strong></p>
<p>تطبيق الأخبار بقوم بإدارة أخبار الموقع و تصنيفها حسب نوع الخبر و يسمح للأعضاء بالتعليق على هذه الأخبار , كما يتم نسب كل خبر الى كاتب له ضمن تاريخ محدد و كل خبر يتم ادراجه بأكثر من لغة حسب اللغات التي يعتمدها الموقع ليتمكن الزوار من رؤية الخبر باللغة التي يفضلونها.</p>
<p>كل الأخبار :<br />
  هنا يتم عرض الاخبار التي تم اضافتها من قبل, مع صورة مصغرة عن الخبر و عنوان الخبر و اسم العضو الكاتب له و كذلك الامر التاريخ و الوقت و هل هذا الخبر يتم نشره او لا و كم مرة تم قراءة هذا الخبر .<br />
أيضا يمكن للمدير الإطلاع على تعليقات لزوار على هذا الخبر, هذه التعليقات مرتبطة بالخيبالخيارت التي طبقها المدير بالسماح للزوار او الاعضاء بالتعليق دون موافقته المسبقة أو لا,  أيضا يمكن للمدير من هنا حذف الخبر الى سلة المحذوفات و تعديل كل خبر على حدى.</p>
<p>أنواع الأخبار :<br />
  لتسهيل مهمة ادارة الاخبار و تصنيفها , تم وضع خيار ارتباط الخبر بنوع معين, مثل الاخبار العامة, الأخبار الاقتصادية, الاخبار الرياضية و ذلك يرجع لحسب نوع الموقع .<br />
هنا تجد لائحة بالأنواع و تعديلها و حذفها أيضا الى سلة المحذوفات.</p>
<p>نوع خبر جديد:<br />
عند إضافة نوع خبر جديد سيتم اظهار خانات بكل اللغات التي يعمل عليها الموقع حالياً.</p>
<p>إضافة خبر :<br />
  عند اضافة خبر و تم وضع الخبر بحالة &quot; نشط &quot;
 فيستم اظهاره للزوار ضمن آخر اخبار منشورة كمختصر حسب إدخال &quot; مختصر الخبر &quot; في الخانة المخصصة لها, لذلك يجب أن تراعي عدد الكلمات كي يظهر بمظهر جميل في الصفحة الرئيسية لتطبيق الاخبار, في المختصر عادة يكون هناك تلخيص لكامل الخبر اذا اراد الزائر رؤية التفاصيل فيمكنه كبس رابط المزيد و رؤية &quot; كامل الخبر &quot; حيث ستدخل الخبر و المصادر و الصور ايضا و غبره من مواد .<br />
 التاريخ : يكون عادة تاريخ اليوم.<br />
 الإسم :
 هو اسم العضو الذي سيكتب الخبر باسمه, و لدواعي امنية نحن نفضل اذا كان المدير خاصة &quot; آدم &quot; هو من يكتب الأخبار ان يقوم بانشاء حساب جديد كمستخدم عادي و ينشر الاخبار باسمه, كي لا يعرف المخترقون اسم الكنية لهذا المدير .<br />
نشط : في حالة اردت كتابة الخبر و تقوم بتعديله اكثر من مرة قبل نشره يمكنك وضعه بحالة نشط كلا و عند اكتمال الخبر حول القيمة الى نشط نعم .<br />
صورة الخبر : هي صورة رمزية لنوع الخبر للترتيب .<br />
العنوان : هو العنوان الذي سيظهر للزائر حسب اللغة التي اخترتها.<br />
عنوان فرعي  : يظهر كعبارة اسفل العنوان بمثابة شرح للعنوان .<br />
مختصر الخبر : هي المعلومات الاساسية التي تريد ايصالها للزائر من هذا الخبر,<br />
كامل الخبر : هنا تضع كامل الخبر حسب اللغة المختارة مع مرفقات كصور و فيديو الخ .
<br />
ملاحظة الخبر :  هنا يمكنك كتابة سطر أخير سظهر مع كامل الخبر .<br />
حفظ مع شريط الاخبار : يتوفر مع phpTransformer شريط اخبار متحرك يظهر عادة تحت ترويسة الموقع , هذا الشريط هو تطبيق قئام بذاته من هنا يمكنك اضافة عنوان الخبر اليه مع الرابط له بشكل اتوماتيكي .<br />
حفظ : تقوم بحفظ الخبر , هذا الزر يمكن كبس بواسطة اختصار لوحة المفاتيح CTRL+S , في حال لم تدخل المعومات الاساسية المطلوبة في الخانات المخصصة لها و كبست زر الحفظ سيقوم phpTransformer باعلامك بذلك .</p>
