<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>اللائحة الرئيسية<br />
  </strong>هي عبارة عن بلوك  مخصص تظهر فيه روابط مهمة مثل عناوين الصفحات كما يمكن للمدير إضافة روابط خارجية  أخرى.</p>
<p>يمكنك من خلال هذه الصفحة أن تقوم بإستعراض عناصر اللائحة كما يمكنك إضافة عنصر جديد و تعديل عناصر سبق و أن قمت بإضافتها و أيضاً حذف عنصر محدد بشكل نهائي دون تحويله الى سلة المحذوفات.</p>
<p><u>العنوان: </u>هو النص الذي سيظهر للزائر. <br />
  <br />
  <u>الرابط: </u>هو العنوان الذي سيتم تحويل الزائر اليه عند كبسه , و الربط هنا نوعين داخلي و خارجي, العنوان الداخلي هو عنوان من ضمن الموقع نفسه و ننصح هنا بإدخال الرابط من دون اسم الموقع و المجلد الذي يعمل منه كما أنه من الافضل نزع قيم اللغة من الرابط لتفادي التحول الى اللغة الخرى, اما اذا كان العنوان خارجي فيجب إدخاله كاملا مع http:// .<br />
مثال عن رابط داخلي :Prog-pages_pagenbr-2.pt
<br />
مثال عن رابط خارجي: http://www.google.com.lb<br />
<br />
<u>الوجهة:</u> في حال تحديد نص في هذه الخانة فهذا يعني أنه سيتم فتح العنوان بنافذة جديدة في المستعرض .<br />
<br />
<u>خارجي :</u> إذا تم تحديد قيمة نعم هنا فسيقوم phpTransformer بوضع الرابط ضمن الروابط الخارجية و يتم اعادة التحويل اليها عبر البرنامج exlink .<br />
<br />
<u>ترتيبه من أعلى:</u> تظهر العناصر في اللائحة الرئيسية مرتبة من فوق الى تحت حسب ترتيب عددي.<br />
<br />
  <br />
</p>