<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>خيارات<br />
  </strong> مرونة phpTransformer و إمكانية تخصيصه نابعة من تمتعه بخيارات يمكن تعديلها و تفعيلها حسب رؤية المدير لموقعه, مثل البرنامج الإفتراضي و رقم الصفحة الرئيسية و اللغة الافتراضية و الشكل الافتراضي و تحديد لغة بلد الزائر و طريقة مشاركة الزوار و موافقة المدير المسبقة الى غيرها من المتغيرات الجميلة مثل المدير الآلي و صداقة محركات البحث, كما ان مفتاح الترخيص الدعم الفني الأساسي يتم ادخاله هنا.
</p>
<p>&nbsp;</p>
<p>المدير الآلي : الحالة الافتراضية له هي كلا و يتم استخدامه فقط في حالة المواقع الديناميكية للغاية. </p>
<p>Search Engine Optimization : الحالة الإفتراضي له هي نعم, فهذه الخاصية ستجعل الموقع اكثر قابلية للتعامل معه مع محركات البحث العالمية.</p>
<p>إسم الموقع الكامل : يتم اظهاره في لوحة تحكم المدير و في واجهة الزوار في حال كان الشكل الحالي يدعم هذا المتغير , هذا الاسم فريد و بلغة واحدة فقط.</p>
<p>البرنامج الافتراضي الذي سيظهر للزائر : عندك طلب الموقع بإسم النطاق فقط دون اي رابط مخصص سيتم تحويل الموقع لبرنامج معين يمكنك تحديده من هنا.</p>
<p>رقم الصفحة الرئيسية : في برنامج الصفحات هناك رقم لكل صفحة, و عند طلب برنامج الصفحات دون رقم صفحة فسيتم اظهار رقم هذه الصفحة, رجاءً لا تقم بادخال رقم صفحة محذوفة أو غير موجودة بالفعل و إلا سيظهر للزائر عبارة تفيد بذلك.</p>
<p> اللغة الافتراضية للموقع : عند طلب الموقع بدون تحديد لغة في العنوان يقوم phpTransformer بعرض الموقع بهذه اللغة.</p>
<p> الشكل الافتراضي للموقع : يتمتع phpTransformer بمرونة في الشكل فلكل عضو لديه شكل مفضل, لكن للزوار الغير مسجلين سيظهر لهم الموقع بهذا الشكل.</p>
<p> دعم لتحديد لغة الموقع حسب بلد الزائر : إن كل رقم IP يرتبط بعنوان المتصل الفعلي , باستثناء البعض القليل , اذا قمت باعطاء قيمة نعم فسوف يتم تحديد لغة الموقع حسب بلد الزائر التي قمت مسبقاً باختيارها في لغات البلاد في الصفحة الرئيسية للوحة تحكم المدير .</p>
<p> تحويل حرف @ الى صورة لتفادي السبام : توجد على شبكة الانترنت بعض البرامج التي تقوم بمسح صفحات المواقع بشكل دوري مفتشة عن عنواين البريد الالكتروني لتقوم فيما بعد بارسال رسائل اعلانية مزعجة لاصحاب هذه العنواين, هذه البرامج تميز البريد الإلكتروني عبر الحرف @ لذلك اذا قمت باعطاء قيمة نعم لهذا الخيار فسوف يتم تحويل حرف @ الى صورة صغيرة مرسوم فيها هذا الحرف فلا تتمكن هذه البرامج من سرقة العناوين من الموقع.</p>
<p> المدة الإفتراضية التي يتذكر بها الموقع الزائر : يعرف الموقع انك قمت بزيارته من قبل من على جهاز معين عبر وضع قيمة في ملف في المستعرض تسمى كوكيز , مع وضع تاريخ انتهاء صلاحية لهذه الكوكيز, من هنا يمكنك تحديد المدى هذه فلا يحتاج العضو اعادة كتابة كلمة سره من جديد كل مرة.</p>
<p> هل الموقع مفتوح للزوار : هناك بعض العمليات التي تجري في الموقع تحتاج منك ان تقوم بوضع رسالة للزوار ان الموقع مغلق حاليا بدل عرض المعولمات عليهم, مثال على ذلك عملية تحديث البرامج فيه .</p>
<p> التوقيت الافتراضي للموقع حسب غرينتش : لكل بدل توقيته الخاص بالزائد او الناقص حسب توقيت غرينتش , وكل زائر للموقع لديه توقيته الخاص لذلك لا بد من تحديد التوقيت الخاص بالموقع حتى لو اختلف عن توقيت الفعلي للخادم المضيف له لمعرفة حساب الوقت لكل الاعضاء بشكل صحيح.</p>
<p> مشاهدة الجزء العلوي : يمكن وضع خيار اخفاء جزء كامل من الموقع بكامل البرامج , عند وضع قيمة كلا لهذا الخيار فإن الجزء المسمى علوي لن يظهر بكافة اقسام الموقع.</p>
<p> مشاهدة شريط الاخبار : اذا تم اعطاء هذه القيمة كلا فلن يظهر شريط الاخبار بجميع اقسام الموقع حتى لو تم تحديد اظهاره في التحكم بالبرامج.</p>
<p> مشاهدة اللوائح : اذا كنت لا ترغب باستخدام اللوائح في موقعك افضل مكان لاخفائها هي ان تعطي لهذا الخيار قيمة كلا.</p>
<p> مشاهدة الطرف الاساسي : اذا كنت ترغب ان يكون موقعك يظهر فيه عامود واحد فقط من البلوكات فيمكنك ذلك باعطاء هذا الخيار قيمة نعم , لكن جميع البلوكات يجب أن تكون في الطرف الثانوي.</p>
<p> مشاهدة الطرف الثانوي : اذا كنت ترغب ان يكون موقعك يظهر فيه عامود واحد فقط من البلوكات فيمكنك ذلك باعطاء هذا الخيار قيمة نعم , لكن جميع البلوكات يجب أن تكون في الطرف الأساسي, الفرق هنا بين الطرف الاساسي و الثانوي هو مكان وجود البلوكات على اليمين او اليسار حسب اتجاه اللغة .</p>
<p> مشاهدة الجزء السفلي : اذا لم ترغب أن يظهر الجزء السفلي من الموقع بتاتاً قم باعطاء هذا الخيار قيمة كلا, لكن يجب أن تنتبه لموضوع رخصة استخدام phpTransformer التي تفرض عليك ذكر مصدر برنامج موقعك انه من phptransformer.com لذلك يجب أن تضع هذه العبارة بكل الصفحات بمكان آخر غير الجزء السفلي منه.</p>
<p> مشاهدة البرنامج : ان اساس phpTransformer هي البرامج التي تظهر عادة بالمساحة المتوسطة من الصفحة , و الباقي يتكرر حسب تفضيلات المدير لكن احيانا هناك حالات يحب فيها المدير اظهار كل شي ما عدا البرنامج نفسه, من هنا يستطيع ان يعطي قيمة كلا و ينفذ طلبه.</p>
<p> هل تسجيل أعضاء جدد في الموقع مسموح حالياً  : تتعرض بعض المواقع لهجمة تسجيل بسبب كثرة الطلب عليها و تضطر الى توقيف التسجيل لتخفيف الضغط عليها لفترات معينة, من هنا يمكنك وضع قيمة كلا و ستعرض رسالة بتوقف التسجيل حاليا للزوار .</p>
<p>&nbsp;</p>
<p> عنوان الموقع الذي يقدم خدمة تحديد بلد الزائر : بعض المواقع تقدم خدمة تحديد بلد الزائر عبر تحويل رقم الـ 	IP الى كود البلد , منهم نحن علبر العنوان :<div dir="ltr"> http://phptransformer.com/GeoIpDectecter/index.php?ip =
</div>
<p>اذا لم تكن متأكداً مما تفعله رجاءً لا تقم بتغيير هذه القيمة و الا ستفقد هذه الخاصية . </p>
<p> هل يجب على المدير الموافقة على كل عملية تسجيل قبل تمكين المشاركة :  بعض المواقع الخاصة يجب أن تكون الاعضاء لديهم أعضاء بالفعل في الجمعية او النادي, لذلك يشترطوا وجود عضوية فعلية قبل عضوية الموقع على الانترنت لذلك اذا وضعت قيمة كلا في هذا الخيار لن يستطيع العضو المشاركة قبل موافقة المدير .</p>
<p> عدد المحاولات المتتالية لارسال معلومات في الموقع : الانسان عادة يرسل معلومات الى الموقع مع اخطاء لعدد ثلاث مرات فإذا كان هناك ارسال للموقع لمعولمات خاطئة مثل كلمة السر فهذا تفسير انها عملية تجربة مستمة للوصول الى معولمة صحيحة من قبل برمجيات خبيثة , لذلك يجب تحديد عدد معين للمحاولات هذه .</p>
<p> هل يسمح للزوار بالمشاركة في الموقع دون تسجيلهم كاعضاء : أغلب المواقع حالياً تسمح للمشاركة فيها دون مراقبة مسبقة و تكون المراقبة فيما بعد, phpTransformer تم تزويده بجدار ناري يغني بكثير من الاحيان عن المراقبة المسبقة, لكن اذا اردت من زوارك ان يتم تسجليهم كاعضاء قبل السماح لهم بالمشاركة , ضع قيمة نعم في هذاا الخيار.</p>
<p> تفعيل نظام تجميع احصائيات خاصة عن الزوار : يقوم نظام تجميع الاحصائيات بجمع معلومات عن الزوار مثل العدد و عدد الصفحات التي تم تصفحها, و البلد و أنظمة التشغيل و المستعرضات و الشاشات , هذه المعلومات مفيدة لتطوير الموقع و ليست حساسة لشخص محدد بل كمجموع لكنها تسبب بطيء بسيط للموقع في بعض الحالات, اذا اردت تقعيل هذا الامر في موقعك لا تنسى ان تزود معلومات عن هذا النظام لزوارك و ضع قيمة نعم في هذا الخيار.</p>
<p> طريقة ارسال البريد الإلكتروني : يتوفر طريقتين لارسال الرسائل للزوار إما عبر sendmail الذي ياتي مدمجاً مع نظام التشغيل لينكس و نظام smtp معظم شركات الاستضافة تستخدم sendmail لكن اذا اردت ان تستعمل smtp فيجب عليك تحديد القيم الازمة لذلك في ملف config.php أو عبر برنامج الـ setup .</p>
<p> طريقة ارسال البريد الإلكتروني : البريد الذي سيظهر ان رسائلك قادمة منه للزوار , لا تستعمل هنا بريد غير صحيح لتفادي عدم وصول رد على رسائلك و وضع موقعك على انه مرسل سبام, كما لا تقم بوضع بريد شخصي لان هذا البريد بعد فترة سيصبح معروفاً من الجمهور.</p>
<p> توقيع المدير في الرسائل و المشاركات : يمكنك هنا ادراج جملة او تصميم يرفق بأسفل  كل رسالة ترسلها من الموقع , يمكنك هنا استخدام وسوم html .</p>
<p> مجلد نسخة الاحتياط من قاعدة البيانات : لكل مدير مسار خاص يحتفظ فيها بنسخخه الاحتيايطة , هذا المسار يجب أن يكون صحيحا لتتم عملية النسخ الاحتياطي لقاعدة البيانات بشكل جيد, عادة نحن نضع بشكل افتراضي نسخ الاحتياط هنا :<br />
<div dir="ltr" >admin/todo/support/backups/</div>
</p>
<p> كود Google analytics : معظم المواقع حاليا تستخدم خدمة <a target="_blank" href="http://www.google.com/analytics/">Google analytics</a>  لجمع احصائيات عن زوار الموقع بشكل مفصل و دقيق , هذه الخدمة لا يمكن تشغيلها من دون كود تقوم شركة جوجل بتسليمه لكل مدير موقع بشكل منفصل.</p>
<p>ترخيص : عند طلبك دعم فني من فريق عمل phpTransformer فإنه يتم تزويدك بمفتاح يجب لصقه هنا, اذا كان هذا المفتاح لقلب البرنامج و البرامج و البولكات و الاشكال الرئيسية , اما اذا كان المفتاح الذي حصلت عليه مخصص لبرنامج أو شكل او بلوك محدد فيجب أن تقوم بلصقه بموضع الصحيح في التحكم بالبرامج او البولكات او الاشكال.</p>