<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>التحكم بالبرامج<br />
  </strong>ينقسم شكل الموقع الى إجزاء يمكن أخفاؤها و إظهارها تبعا لكل برنامج على حدى, على سبيل المثال برنامج RSS الخاص بتوزيع الاخبار يجب ان لا يتم فيه إظهار جميع أقسام الموقع سواه و إلا حدث خطأ في برامج إستعراض RSS عند الزائر, أقسام الموقع هي :<br />
  القسم العلوي حيث يظهر عادة لولغو .<br />
  شريط الأخبار الذي تتحرك فيه آخر الأخبار. <br />
  اللوائح المنسدلة حيث يتم تبويب روابط صفحات الموقع.<br />
  الطرف الأساسي و الثانوي و هما عبارة عن عامودين يتم فيها ترتيب البلوكات.<br />
  الجزء السفلي و يتم فيه عادة ذكر شروط الاستخدام و سياسة الخصوصية و رابط خاص بـphpTransformer ليجب عدم حذفه طبقا لرخصة استخدامه phpTransformer الحرة المفتوحة المصدر. <br />
  البرنامج و هي المساحة التي سيظهر فيها البرنامج نفسه فيها.
</p>
<p>إختر ما تريد من قيم و إكبس حفظ أو ctrl+s و شاهد الفرق .</p>
<p>أيضا من هنا يمكنك إدخال مفتاح الدعم الفني و تعديل.</p>