<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
المساعدة العربية
<br/> <a href="?help=todo&item=groups&Lang=Arabic&nl=1"> المجموعات </a>
<br/>&nbsp;&nbsp;&nbsp;&nbsp; <a href="?help=todo&item=groups&subitem=EditGroup&Lang=Arabic&nl=1">تعديل المجموعات</a>

<br/>البرامج
<br/> <a href="?help=prog&item=account&Lang=Arabic&nl=1"> حساب الاعضاء </a>

<br/>البلوكات
<br/> <a href="?help=block&item=account&Lang=Arabic&nl=1"> حساب الاعضاء </a>



<p><strong>الشريط العلوي :<br />
  </strong>يحتوي الشريط العلوي على  المصادر التي قد تحتاجها في جميع أنحاء لوحة تحكم المدير وفيه شعار البرنامج.<br />
  <u>أيقونة التحديث التلقائي:</u> تظهر في حال وجود تحديث  لـ <span dir="ltr">phpTransformer</span> او لأحد أجزائه مثل البرامج أو البلوكات أو الأشكال ,  هذه الأيقونة لا تظهر إذا كان كل شي يعمل بآخر إصدارة متوفرة.<br />
  عند وجود تحديث تظهر هذه الأيقونة و عند وضع مؤشر الفأرة عليها يظهر عدد التحديثات  المتوفرة, و عند الكبس عليها تأخذك إلى رابط التحديث حيث يمكن إجراء التحديثات.<br />
  <u>رابط الموقع:</u> يظهر اسم الموقع الذي  قمت بإدخاله في أيقونة &quot;خيارات&quot; و عند الكبس عليه يأخذك في صفحة جديدة إلى  الموقع الذي يظهر للزوار.<br />
  <u>لائحة الوصول السريعة</u>: يدرج فيها جميع جوانب  لوحة تحكم المدير , عند انتقائك لأي عنصر من هذه اللائحة المنسدلة يتم تحويلك  بسرعة إلى الصفحة التي اخترتها.<br />
  <u>لائحة لغات لوحة تحكم  المدير: </u>من خلال هذه اللائحة المنسدلة يمكنك التبديل بين اللغات التي تتوفر فيها  لوحة تحكم المدير, أيضا عند انتقال المدير للغة جديدة يتم تسجيلها كلغة مفضلة له و  على هذا الأساس في المرة القادمة التي يسجل فيها هذا المدير دخوله تظهر لوحة  التحكم بهذه اللغة بشكل افتراضي.<br />
  <u>أيقونة المساعدة:</u> ببساطة تظهر هذه  المساعدة.<br />
  <u>أيقونة الصفحة الرئيسية :</u> تأخذك دائما إلى صفحة  المدير الرئيسية.<br />
  <u>أيقونة تسجيل الخروج:</u> عند انتهائك من العمل  ننصح بشدة تسجيل خروجك, حتى لا يستغل أحد غيرك عملية تسجيل دخولك على نفس الجهاز.<br />
  <br />
  <strong>ملاحظات المرة القادمة :</strong><br />
  هنا يمكنك كتابة ملاحظات  قد تقوم بها في المرة التالية أو كتذكير لك بمهمة ما, هذه مساحة حرة يمكنك الكتابة  فيها ما تشاء و تظهر لك فقط في لوحة تحكم المدير, كما تم تزويدها بتنسيقات للنص  المكتوب قريبة من تنسيقات معظم برامج تحرير النصوص.<br />
  <strong> </strong>( للحفظ يمكنك استخدام اختصار المفاتيح <span dir="ltr">CTRL+S</span> )  <br />
  <br />
  <strong>لائحة المتابعة :</strong><br />
  تمت برمجة هذه اللائحة ليتمكن  المدير من متابعة آخر الأعمال التي طرأت على الموقع, مثلا تظهر آخر بلوك و آخر  برنامج تمت إدارته , و أسفلهم تظهر آخر تعليقات من الزوار على برنامج الأخبار و  المعرض بدل من أن يقوم المدير بتفقد كل صفحة في كل مرة يدير فيها الموقع, كما تم  إدراج عدد الأعضاء المسجلين الذين بحاجة لموافقة المدير قبل تمكين مشاركتهم و أيضا  عدد الأعضاء الذين يرغبون بالإعلان في الموقع و يحتاجون موافقة مسبقة, مع العلم أن  خيار تحديد طريقة تفاعل الزوار مع الموقع يتم تحديدها في أيقونة &quot; خيارات  &quot;.<br />
  <strong>مركز الرسائل :</strong><br />
  من هنا يتم نشر رسائل  مهمة من موقع <span dir="ltr">phpTransformer</span> إلى لوحة تحكم مدراء المواقع يتم فيها تنبيههم لأمور يحتاجونها  في إدارة مواقعهم, في حال عدم وجود رسائل تظهر رسالة للذين يتمتعون بترخيص دعم فني  : شكرا لاستعمالك <span dir="ltr">phpTransformer</span> ! أما للذين لم يحصلوا على دعم فني بعد تظهر لهم  رسالة أخرى تخبرهم عن فوائد و طريقة الحصول على دعم فني.<br />
  <br />
  <strong>الإحصائيات :</strong><br />
  في هذا القسم من الصفحة  الرئيسية للوحة تحكم المدير يمكنك متابعة الإحصائيات عن استخدام الزوار للموقع مثل  عدد الأعضاء المسجلين و عدد الجلسات في آخر يوم و متوسط عدد الصفحات التي يتطلع  عليها الزائر, البلدان التي يزورن الموقع منها, اللغات المفضلة لديهم بالموقع,  الصفحات الأكثر زيارة, أنظمة تشغيلهم المستعرضات التي يستخدموها, حجم الشاشات و  أشكال الموقع التي يفضلونها.<br />
  هذه المعلومات مهمة لتطوير الموقع و معرفة ميول الزوار للتركيز عليها و استثمارها  لنجاح الموقع.<br />
  ملاحظة: بعض هذه الإحصائيات تتوقف في حال قرر مدير الموقع  إيقاف تفعيل نظام جمع المعلومات عن الزوار في  أيقونة &quot; خيارات &quot;<br />
  <br />
  <strong>الشريط السفلي :<br />
  </strong>يظهر في هذا  القسم معلومات عن ترخيص الدعم الفني و رقم الإصدار الحالي الذي يعمل عليه الموقع و  الرخصة كذلك, و بما أن <span dir="ltr">phpTransformer</span> هو برنامج حر مجاني و مفتوح المصدر يجب عليك احترام  الاتفاقية و عدم نزع كلمة <span dir="ltr">phpTransformer</span> منه على الإطلاق, و في حال قررت إطلاق إصدارتك  الخاصة المعدلة, يجب عليك الإشارة إلى أنها نسخة معدلة من <span dir="ltr">phpTransformer</span> .<br />
  <br />
<strong>الأيقونات</strong></p>
<blockquote>
  <p><strong>إدخال المعلومات</strong>
  </p>
</blockquote>
<ul>
  <ul>
    <li><strong>إدارة برنامج<br />
      </strong>البرامج هي الجزء  الذي يظهر بمنتصف الصفحة للزائر و هي عبارة عن برنامج متكامل يدمج من ضمن أقسام <span dir="ltr">phpTransformer</span> ,  من خلال هذه الأيقونة يمكن انتقاء البرنامج الذي تريده و تقوم بمهام يوفرها مطور  هذا البرنامج مثل التحرير و الحذف و الإضافة و الحفظ . </li>
    <li><strong>إدارة بلوك<br />
      </strong>البلوكات هي  عبارة عن برمجيات صغيرة الحجم تظهر عادة للزائر على يمين و يسار الصفحة ضمن أعمدة مخصصة  لها , من خلال هذه الأيقونة يمكن انتقاء البلوك الذي تريده و تقوم بمهام يوفرها  مطور هذا البلوك مثل التحرير و الحذف و الإضافة و الحفظ .</li>
    <li><strong>اللائحة الرئيسية<br />
      </strong>هي عبارة عن بلوك  مخصص تظهر فيه روابط مهمة مثل عناوين الصفحات كما يمكن للمدير إضافة روابط خارجية  أخرى.</li>
    <li><strong>  الصفحات<br />
      </strong>تم وضع أيقونة  برنامج الصفحات هنا لتسهيل الوصول المدير لها, لأنه يحتاجها بشكل شبه يومي.</li>
    <li><strong>شريط الأخبار<br />
      </strong>باستطاعة المدير  تمرير الأخبار عبر شريط خاص مستمداً المعلومات من برنامج الأخبار أو عبر الإدخال  اليدوي المباشر.</li>
    <li><strong>اللوائح المنسدلة<br />
      </strong>يوفر <span dir="ltr">phpTransformer</span> لوائح منسدلة تظهر للزائر لتنظيم الوصول إلى المعلومات بدل عرضها كلها دفعة  واحدة كما أنها سوف تترتب بشكل أنيق.</li>
  </ul>
  <p><strong>الأعضاء و المراسلات</strong></p>

  <ul>
    <li><strong>الأعضاء<br />
    </strong>    من هنا يمكنك إدارة أعضا موقع مثل اضافة عضو جديد أو حذف أو طرد أو بحث عن عضو ما أو تغيير كلمة سر أحدهم.    </li>
  </ul>

  <ul>
    <li><strong>المجموعات<br />
    </strong>    يأتي مع phpTransformer ثلاث مجموعات هي من ضمن النظام لا يمكن حذفها هي مجموعة الزوار Guests و هم الزوار الذين لم يتم تسجيلهم في الموقع و لم يحصلوا على عضوية دائمة, و مجموعة Users و هم الأعضاء بالفعل و يستطيعون تسجيل دخولهم عبر اسم مستخدم و كلمة مرور و مجموعة ثالثة هي مجموعة Admins و هم أعضاء يتمتعون بصلاحية إدارة الموقع. كما يمكنك إنشاء مجموعات تطلق عليها التسمية التي تريد لتطبق عليها فيما بعد الصلاحيات التي تراها مناسبة كما يمكنك حذفها و إبدال أعضاء مجموعة بمجموعة أخرى و إستعراض أعضاء مجموعة ما و تغيير مجموعة عضو معين و تعديل المجموعة.    </li>
  </ul>

  <ul>
    <li><strong>المدراء<br />
    </strong>    المدراء هم المجموعة التي يسمح لها بإدارة الموقع, يوجد هناك مدير له صلاحيات مطلقة يكون هادة هو اول مدير للموقع يطلق عليه تسمية &quot;آدم&quot; و باقي المدارء يمكن تحديد صلاحيات وصولهم لأجزاء معينة من الموقع كما يمكن اضافة عضو الى لائحة المدارة كما يمكن إيقاف مدير لفترة ما و حذفه ايضا.    </li>
  </ul>

  <ul>
    <li><strong>اللائحة البريدية<br />
    </strong>يوفر phpTransformer ميزة تواصل مع الأعضاء عبر لائحة بريدية يتم فيها تصميم نماذج رسائل يمكن استخدامها اكثر من مرة و يتم بعدها ارسالها لكل الأعضاء أو لأعضاء مجموعة معينة أو لعضو يمكن تحديده أو لبريد إلكتروني ما. <br />
    <br /></li></ul>
    <strong>الحماية و الأمن</strong>
  <br />
  <br />
  <ul>
    <li><strong>الجدار الناري<br />
      </strong> في عالم الإنترنت لا يمكنك الوثوق بكل الزوار فهناك أشخاص يهدفون الى التخريب , لذلك تم وضع جدار ناري لحماية الموقع , من خلاله يمكنك طرد عنوان IP أو طرد بريد إلكتروني محدد ووضع لائحة بالكلمات البذيئة التي لا تريدها أن تظهر على صفحات الموقع , كما يمكنك إستعراض محاولات الدخول الفاشلة عبر لوحة التحكم المدير , أيضا phpTransformer يراقب الطلب الزائد عليه لمحاولة اغراقه فيمنع ذلك.</li>
  </ul>

  <ul>
    <li><strong>صلاحيات البرنامج<br />
      </strong>صحيح أن عالم الإنترنت هو عالم معلومات مفتوح للجميع, لكن أحياناً هناك برامج ترغب في تخصيص الوصول اليها لأشخاص محددين كلوائح أسعار منتوجاتك مثلا, لذلك تم إنشاء صلاحيات لكل برنامج يطبق السماح و المنع عليه حسب مجموعة معينة من الاعضاء.</li>
  </ul>

  <ul>
    <li><strong>صلاحيات البلوك<br />
      </strong>هناك بلوكات يجب حصر الوصول اليها لمجموعة معين من الأعضاء و يجب تطبيق صلاحيات عليها, مثل نحن في موقعنا الرسمي وضعنا بلوك الشركاء محصوراً بالاعضاء المسجلين لدينا و لا يظهر لجميع الزوار.</li>
    <li><strong>أذونات خاصة<br />
      </strong>بعض المبرمجين قد يحتاج لتطبيق صلاحية وصول على جزء معين من برنامجه, على سبيل المثال اذا طبقت صلاحية وصول لبرنامج الصفحات على أن يستطيع الجميع تصفحه لكن تريد لصفحة معين أن يتم الوصول اليها لمجموعة محددة يمكنك من هنا تطبيق ذلك بسهولة.<br />
      <strong><br />
    </strong></li>
  </ul>
 <strong>      إدارة و تحكم</strong>
    <br /><br />

  <ul>
    <li><strong>التحكم بالبرامج<br />
      </strong>ينقسم شكل الموقع الى إجزاء يمكن أخفاؤها و إظهارها تبعا لكل برنامج على حدى, على سبيل المثال برنامج RSS الخاص بتوزيع الاخبار يجب ان لا يتم فيه إظهار جميع أقسام الموقع سواه و إلا حدث خطأ في برامج إستعراض RSS عند الزائر, أقسام الموقع هي :<br />
      القسم العلوي حيث يظهر عادة لولغو .<br />
      شريط الأخبار الذي تتحرك فيه آخر الأخبار.
      <br />
      اللوائح المنسدلة حيث يتم تبويب روابط صفحات الموقع.<br />
      الطرف الأساسي و الثانوي و هما عبارة عن عامودين يتم فيها ترتيب البلوكات.<br />
      الجزء السفلي و يتم فيه عادة ذكر شروط الاستخدام و سياسة الخصوصية و رابط خاص بـphpTransformer ليجب عدم حذفه طبقا لرخصة استخدامه phpTransformer الحرة المفتوحة المصدر.
      <br />
      البرنامج و هي المساحة التي سيظهر فيها البرنامج نفسه فيها.
      <strong><br />
      </strong></li>
  </ul>
  <strong></strong>
  <ul>
    <li><strong>التحكم بالبلوكات</strong> <br />
      يمكن ترتيب البلوكات في الموقع بحيث يتم نقل مكانهم من الطرف الأساسي الى الفرعي و بالعكس كما يمكن ترقيم ترتيبهم من أعلى الى أسفل بنفس الطرف.  </li>
  </ul>

  <ul>
    <li><strong>ملفات الموقع<br />
      </strong>يتميز phpTransformer بوجود مدير ملفات مدمج فيه يتم عبر إدارة جميع ملفات الموقع دون إستثناء كما يمكنك التعامل مع الملفات بالرفع و التنزيل و ايضا ضغط الملفات و نقلها و نسخها و حذفها و تطبيق صلاحيات وصول عليها مما يقلل من نسبة الحاجة الى الدخول للوحة تحكم استضافة الموقع بشكل كبير.</li>
  </ul>

  <ul>
    <li><strong>اللغات<br />
      </strong>إن البنية الأساسية التي قام عليها phpTransformer هي دعمه لتعدد اللغات ليس لشكل الموقع فقط بل لمضمونها أيضا فكل صفحة فيه يمكنك استعراضها بأكثر من لغة دون الحاجة للذهاب الى موقع آخر بلغة أخرى, ملفات اللغة هذه يمكن تفعيلها و حذفها و على هذا الاساس فإن اي برنامج سيظهر بلغة ما للزائر سيمون إعتماده على هذه الأيقونة.</li>
  </ul>
  <ul>
    <li><strong>لغات البلاد<br />
      </strong>يقوم phpTransformer بتحديد بلد الزائر عبر تفعيل هذه الخاصية من أيقونة الخيارات و بناءً عليه يتم عرض الموقع للزائر حسب لغة بلده المحددة هنا .</li>
  </ul>
  <ul>
    <li><strong>أشكال الموقع<br />
      </strong> الجميل أنه بإستطاعتك تغيير شكل موقعك بكبسة زر واحدة عبر تفعيل شكل معين , كما يمكن للأعضاء تحديد الشكل الذي يفضلوه من لوحة تحكمهم الخاصة تبعاً لما تفعله من هنا من أشكال.<br />
  </ul>
</ul>
<blockquote>
  <p><strong> مشاركة و دعم فني</strong>

  </p>
  </blockquote>
<ul>
  <ul>
    <li><strong>قاعدة البيانات<br />
      </strong>إن معظم البيانات التي تدخلها يتم حفظها في قاعدة بيانات MySQL على خادم منفصل عن الخادم الفعلي الذي يعمل عليه الموقع لذلك فأنه من المؤكد عمليا أن تقوم بنسخ احتياطي لقاعدة البيانات عندك حتى إذا ما حدث خطأ ما للموقع أن تستطيع إستعادة آخر نسخة إحتياط تم انشاؤها من قبل, كما أن كثرة إستخدام قاعدة البيانات من إضافة و تعديل و حذف ينتج عنه فراغات لا داعي لها داخل ملف قاعدة البيانات على القرص الصلب و يزيد من حجمها لذلك ننصح كل فترة بعمل تحسين لها مما يحسن من أدائها.</li>
  </ul>
  <ul>
    <li><strong>ترجمات<br />
      </strong> إن واجهة البرنامج يمكن ترجمتها حسب اللغة المحلية لك, كما يمكن تعديل الألفاظ لتتلائم مع طبيعة موقعك, على سبيل المثال رسالة إستقبال الزائر من الممكن أن تكون &quot;مرحبا &quot; أو &quot;مرحبا بك أيها العضو&quot; أو &quot;نرحب بك جانب الدكتور&quot; لذلك أقمنا جانب للترجمة سهل للغاية فيه تستطيع تعديل الترجمات و إضافة ترجمة جديدة كليا, كما يمكنك وضع ترجمة خاصة بك لا يتم اكتابة فوقها في حال تحديث الموقع , أيضا يمكنك مشاركة ترجماتك مع من تحب حتى تنتشر هذه اللغة بين مستخدمي phpTransformer مع الاحتفاظ بكامل حقك كمالك لعملك هذا.</li>
  </ul>
  <ul>
    <li><strong>برمج و شارك<br />
      </strong>إبتداءً من الإصدارة 2.0 من phpTransformer أصبح المبرمجون و المصممون و المترجمون شركاء في نجاحنا فيمكنهم المساعدة عبر ارسال عملهم لنا و نحن بدورنا سنقوم بإدراج أعمالهم في متجر التطبيقات الذي سيكون متوفراً ابتداءً من الاصدارة 2.5 , الشرط الأساسي لقبول العمل هو ان يكون حر مفتوح المصدر , نحن نحتفظ بكامل حقك كمالك لعملك كما يمكنك الحصول على مردود مالي منه.</li>
  </ul>
  <ul>
    <li><strong>أخطاء و تقارير<br />
      </strong> إن معظم مدراء المواقع ليس بمبرمجين و يفضلوا قضاء معظم وقتهم في إدارة الموقع على حل المعضلات البرمجية لذلك قررنا وضع بند خاص في لوحة تحكم المدير يتم فيه تسجيل الاخطاء البرمجية و يتم ابلاغنا عنها عبر البريد الإلكتروني دون الحاجة لدخول لوحة تحكمك الخاصة مع الحفاظ على سرية عملك , كما يمكن لمدير الموقع أن يكتب تقرير خاص غير تلك المدرجة في الاخطاء البرمجية عبر موقع SourceForge.net الذي يستضيف مشروعنا.<br /></ul>
</ul>
      <blockquote>
        <p><strong>النظام و الملفات</strong>

        </p>
      </blockquote>
<ul>
  <ul>
    <li><strong>خيارات<br />
      </strong> مرونة phpTransformer و إمكانية تخصيصه نابعة من تمتعه بخيارات يمكن تعديلها و تفعيلها حسب رؤية المدير لموقعه, مثل البرنامج الإفتراضي و رقم الصفحة الرئيسية و اللغة الافتراضية و الشكل الافتراضي و تحديد لغة بلد الزائر و طريقة مشاركة الزوار و موافقة المدير المسبقة الى غيرها من المتغيرات الجميلة مثل المدير الآلي و صداقة محركات البحث, كما ان مفتاح الترخيص الدعم الفني الأساسي يتم ادخاله هنا.</li>
  </ul>
  <ul>
    <li><strong>سلة المحذوفات<br />
      </strong>لأن المعلومات قيمة جداً بالنسبة لنا و نعتبرها أهم شيء يمكن فقدانه, قمنا بإدراج سلة محذوفات لمعظم مكونات الموقع يمكنك منها إستعادة المعلومة أو حذفها بشكل نهائي و أعتقد أن phpTransformer هو أول برنامج إدارة مواقع يفعل ذلك.</li>
  </ul>

<ul>
  <li><strong>نظام التخزين المؤقت<br />
  </strong>سر سرعة phpTransformer هو بتوفيره هذا النظام, فمن المعلوم ان الوصول الى خادم قاعدة البيانات لجلب المعلومات به و من ثم معالجتها و اظهارها في مستعرض الانترنت تأخذ وقت قد يصل الى حدود 4 ثواني, لكن عند تفعيل نظام التخزين المؤقت نقوم بتخزين نسخة مضغوطة من الصفحة المطلوبة على القرص الصلب للموقع و في المرة التالية نقوم بعرض هذه الصفحة مباشرة للزائر مما يقلل وقت الانجاز الى حوالي 0.3 ثانية فقط.</li>
</ul>
<ul>
  <li><strong>صفحات الخطأ<br />
    </strong>في العادة عند وجود خطأ ما باستعراض الموقع مثل عدم وجود الصفحة المطلوبة أو مجلد يمنع الوصول اليه يظهر خادم Apache رسائل الخاصة به, لكن من هنا يمكنك وضع صفحة تظهر بمظهر جميل مع رسالة واضحة و حتى يمكنك استثمارها في الاعلانات مثلا.<br />
    <br /></li>
</ul>
    <strong>  مركز التطبيقات </strong><br />
      <br />

<ul>
  <li><strong>تحديثات<br />
  </strong>ليس هناك أسهل من يقوم phpTransformer بتحديث نفسه بنفسه دون العناء التنزيل و الرفع و التاكد من التوافقية, ليس فقط لقلب النظام بل ايضا للبرامج و البلوكات المرفقة و الأشكال أيضا.</li>
</ul>

<ul>
  <li><strong>تنصيب<br />
  </strong>إن أي برنامج أو بلوك أو شكل أو لغة لا يمكن أن يستعملها الزائر في الموقع الا بعد تفعيلها و تنصيبها لذلك تم وضع هذه الايقون لتسهل الوصول الى هذه المكونات.</li>
</ul>
<ul>
  </ul>
  <ul>
    <li><strong>الإضافات<br />
    </strong>أوجدت الإضافات لتكون حلا لتعديل كود البرنامج بسهولة من قبل المستخدم النهائي خاصة اذا كان غير ملم بالبرمجة و بكبسة تفعيل أو تعطيل مثال على ذلك إضفاة زر أعجبني الخاص بالفيسبوك في كل صفحات الموقع.</li>
  </ul>
  <ul>
    <li><strong>متجر التطبيقات<br />
      </strong> هذه الخاصية ستتوفر في الاصدارة القادمة حيث ستتمكن من  البحث عن البرمجيات و الاشكال و غيرها من اضافات و استخدامها في موقعك او شراء ترخيص دعم فني لها.</li>
  </ul>
</ul>