<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>الإضافات<br />
</strong>أوجدت الإضافات لتكون حلا لتعديل كود البرنامج بسهولة من قبل المستخدم النهائي خاصة اذا كان غير ملم بالبرمجة و بكبسة تفعيل أو تعطيل مثال على ذلك إضفاة زر أعجبني الخاص بالفيسبوك في كل صفحات الموقع.</p>
<p>ستجد في هذه الشاشة لائحة بالإضافات الموجود حاليا ضمن المجلد /Plugins هذه اللائحة تضم اسم الاضافة و الذي قام بتطويرها و حالتها الحالية اذا تعمل أو لا و على نفس السطر رابط التفعيل و التعطيل.</p>
