<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>اللوائح المنسدلة<br />
  </strong>يوفر <span dir="ltr">phpTransformer</span> لوائح منسدلة تظهر للزائر لتنظيم الوصول إلى المعلومات بدل عرضها كلها دفعة  واحدة كما أنها سوف تترتب بشكل أنيق.
</p>
<p>تقسم اللوائح الى لوائح رئيسية هي الاساسية التي تنبسق عنها لوائح فرعية , أما محتويات كل لائحة فتسمى عناصر, لذلك فإن العنصر في الائحة الرئيسية التي تحتوي على لائحة فرعية  سيكون هو الائحة الفرعية بعينها, من أجل ذلك كي تستطيع استعراض كامل متحويات اللوائح يجب أن تختار &quot; كل العناصر &quot;.</p>
<p>لوائح رئيسية : هنا يتم استعراض اللوائح الرئيسية مرتبة حسب تدرج ظهورها في المستعرض, كما يمكنك من خلال هذه الشاشة أن تقوم بالتعديل و الحذف و استعراض عناصر هذه الللائحة, مع الأخذ بالعلم أن الحذف هنا هو حذف نهائي و لا يمكن استعادتها من سلة المحذوفات.</p>
<p>لوائح فرعية : هنا يتم استعراض اللوائح الفرعية مرتبة حسب تدرج ظهورها في المستعرض, كما يمكنك من خلال هذه الشاشة أن تقوم بالتعديل و الحذف و استعراض عناصر هذه الللائحة, مع الأخذ بالعلم أن الحذف هنا هو حذف نهائي و لا يمكن استعادتها من سلة المحذوفات.</p>
<p>كل العناصر : هنا يتم استعراض كل عناصر الائحة المنسدلة مع النص و و الايقونة الصغير التي ستظهر جنبه و رابطه الذي يمكن ان يكون داخلي او خارجي, و الوجهة اذا تم تحديدها فسيتم فتح نافذة جديدة في المستعرض, اما ترتيبه من أعلى فهو ترتيب هذا العنصر حسب باقي العناصر. كما يمكنك التعديل و الحذف النهائي دون المرور بسلة المحذوفات و استعراض عناصر الائحة اذا كان هذا العنصر هو عبارة عن لائحة رئيسية أو فرعية.</p>
<p>إضافة لائحة : اذا كانت لائحة فرعية فلا حاجة لانتقاء قيمة من الائحة الفرعية, اللائحة الفرعية هي عبارة عن عنصر منبثق من لائحة رئيسية يتم تحديدها كأب لهذا العنصر, أما لايقونة فهي عبارة عن صورة صغيرة جداً تظهر قبل النص, في حال اردت عدم ظهور صورة يمكنك اختيار none.gif . <br />
  النص هو الذي سيظهر للزائر أما العنوان فهو ما سيظهر له عند وضع مؤشر الفأرة عليه, النص و العنوان تم تجميعهم حسب اللغة المفعلة في الموقع.<br />
  الرابط هو العنوان حيث يتم تحويل الزائر اليه.<br />
الوجهة اذا تم تحديدها فسوف تفتح الرباط في نافذة جديدة في المتصفح .</p>
<p>إضافة عنصر : نفس الموضوع بالنسبة لإضافة لائحة لكن الفرق أن العنصر لا ينبثق عن لائحة بل يمكن تحديد نص و عنوان و رابط ووجهة له.</p>