<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>خرائط جوجل :</strong></p>
<p>هي خدمة مقدمة من شركة جوجل العالمية, تسمح لأصحاب المواقع بإدراج خرائط البلدان ضمن مواقعهم مجانا و اضافة تفاصيل عليها .<br />
  رابط التسجيل في هذه الخدمة :<br />
<a href="http://code.google.com/apis/maps/signup.html">http://code.google.com/apis/maps/signup.html</a></p>
<p>خيارات الخريطة : <br />
  تقوم جوجل عند التسجيل معها في هذه الخدمة بتزويدك بمفتاح يجب أن تدخله في خانة مفتاح الترخيص, هذا المفتاح فريد لكل اسم نطاق ولا يمكن استخدامه لاكثر من موقع .<br />
  عرض الطول الخريطة تحدد المساحة التي ستأخذها الخريطة في صفحة التطبيق.<br />
  خط الطول و خط العرض تحدد المكن الافتراضي الذي سيراه الزائر على الخريطة أول مرة.<br />
توفر جوجل ثلاث انواع من الخرائط, صور من القمر الصناعي تظهر الارض كما هي عند التقاطها من الجو, و صور طائرة و خريطة كما تظهر في الأطلس عادة.<br />
درجة التكبير تحدد درجة الارتفاع عن الارض و تاخذ قيمة من واحد الى ثمانية عشر.</p>
<p>كل العلامات : ستجدها فارغة اذا لم تقم باضافة علامات جديدة من قبل, و عند الاضافة ستجد لائحة بالعلامات التي قمت بادراجها مع الايقونة الخاصة بها و عنوانها و احداثياتها مع امكانية التعديل و الحذف.</p>
<p>علامة جديدة : العلامة هي مكان محدد على الخريطة ذو اهمية لك , عند اضافة العلامة ستظهر لزوارك فقط دون التأثير على خرائط جوجل الاصلية. يمكن وضع العلامات على الخريطة التي ستظهر لك في الاسفل و التي من خلالها عند تنقلك فيها سيقوم  التطبيق يتزويدك بالاحداثيات الحالية بين هلالين.<br />
للعلامة ايقونة ستكون ظاهرة على الخريطة و عند الكبس عليها سيظهر مربع حوار فيه العنوان حسب اللغة المنتقاة و شرح عن العلامة.</p>
