<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>الجدار الناري<br />
    </strong> في عالم الإنترنت لا يمكنك الوثوق بكل الزوار فهناك أشخاص يهدفون الى التخريب , لذلك تم وضع جدار ناري لحماية الموقع , من خلاله يمكنك طرد عنوان IP أو طرد بريد إلكتروني محدد ووضع لائحة بالكلمات البذيئة التي لا تريدها أن تظهر على صفحات الموقع , كما يمكنك إستعراض محاولات الدخول الفاشلة عبر لوحة التحكم المدير , أيضا phpTransformer يراقب الطلب الزائد عليه لمحاولة اغراقه فيمنع ذلك.
</p>
<p>طرد IP:<br />
  عندما تقوم بطرد IP فإنه ستحظر كل من يستعمل هذا العنوان للوصول الى موقعك و تصفحه و ستتظهر له رسالة تفيد بذلك.<br />
الحقيقة انه تستطيع طرد مجموعة من العنواين يمكن تحيدي بداية اول IP منها و آخر IP و في حال اردت طرد IP واحد فقط فيمكنك وضعه ذاته في البداية و النهاية, كما يمكنك ترك ملاحظة بسبب الحظر حتى تتزكر في المرة القادمة لماذا قمت بحظره.</p>
<p>ايبيات مطرودة: <br />
  هنا يمكن استعارض ما قمت به سابقا من طرد , و سيظهر ايضا التاريخ , أيضا من هنا يمكنك نزع الحظر عنه.</p>
<p>طرد بريد :<br />
عندما تقوم بطرد بريد الكتروني فإنه لن يتسطيع احد استخدام هذا البريد في المشاركة بالموقع. هنا ايضا يمكنك وضع السبب حتى يعرف باقي المدراء و أنت في المرة القادمة لماذا تم هذا العمل.</p>
<p>بريد مطرود:<br />
هنا يمكنك استعراض ما تم طرده من قبل من قبلك او من قبل مدير آخر من بريد الكتروني مع اظهار التاريخ لذلك, و ايضا هنا تستطيع الغاء الحظر عنه.</p>
<p>كلمات بذيئة:<br />
في الحالات العادية في الانترنت يقوم المدراء بفتح باب المشاركة على الزوار لتشجيعم على التفاعل مع الموقع لكن أحيانا يكون هناك مشاركاة و تحديات نارية تستخدم فيها الألفاظ النابية و الكلمات البذيئة, لهذا يقوم phpTransformer باستبدال هذه الكلمات برموز بدلا عنها , في هذه الشاشة يمكنك ايضا الغاء كلمة تم تصنيفها على انها بذيئة من قبل.</p>
<p>إضافة كلمة بذيئة:<br />
نعم انت مضطر لكتابة الكلمة مرة واحدة هنا لضمان عدم ورودها على صفحات الموقع الخاص بك ,مع السبب الذي دفعك لتصنبفها على انها كلمة بذيئة.</p>
<p>محاولات دخول :<br />
  عند تصميم phpTransformer تمت برمجته بشكل يصعب على المخترقين التخريب به, مع انه مفتوح المصدر, و كل معلومة ترسل له يتم تفحصها قبل قبلوها, من نفس النظرة الأمنية قمنا بجعل مكان الدخول عبر لوحة التحكم للمدير مجهولا للزوار و كل موقع يمكن تسمية هذه الصفحة كما يشاء , لذلك من المفترض أن لا يعرف اسم هذه الصفحة سوى فريق ادارة الموقع, لذلك ان اي محاولة للدخول الخاطىء الى لوحة تحكم المدير هو بحد ذاته مؤشر على تهديد امني , لذلك يمكن لمدير الموقع بعد تسجيل دخول استعراض هذه الائحة و تبيان اذا كان احدهم غيره قد حاول الدخول لانه سيزكر الاسم و كلمة السر و الوقت و اسم الجهاز الذي حاول منه المخترق الدخول.<br />
بعد تفحص الائحة هذه و الاطمئنان ان التسجيل كان خطأ إدخال شخصي يجب محو هذه اللائحة حتى لا يستفاد منها بتوقع الكلمة الفعلية من احد المرداء الآخرين.</p>
<p>مضاد الإغراق:<br />
  من بين انواع التهديد للمواقع هو ما يمسى بهجوم DOS لرفض الخدمة الناتج عن الطلب بشكل هائل للموقع حتى يتم اغراق الموقع بطلبات كثيرة ينتج عنها عدم قدرة الجهاز المستضيف للموقع على الاستجابة للزوار الجدد, لذلك يقوم phpTransformer بتسجيل وقت دخول كل زائر مع رقم جلسته و يقوم بالاستجابة لطلب جديد منه في حال تخطى مدة زمنية تكون عادة حوالي الثانية الواحدة و هي المدة الازمة لنا نحن البشر كي نلاحظ ظهور الصفحة في المستعرض.<br />
هنا يمكنك تعديل هذه القيمة و في حال قام الزائر بطلب الموقع بأقل من هذه القيمة فيسظهر له الموقع رسالة تخبره أن يكون صبوراً.</p>