<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>التحكم بالبلوكات</strong> <br />
  يمكن ترتيب البلوكات في الموقع بحيث يتم نقل مكانهم من الطرف الأساسي الى الفرعي و بالعكس كما يمكن ترقيم ترتيبهم من أعلى الى أسفل بنفس الطرف.
</p>
<p>إسم البلوك :هو الاسم الذي سيظهر في أعلى البلوك, و يمكنك تغييره او جعله فارغا من خلال &quot; تعديل عنوان البلوك&quot; هذا التعديل متوفر باللغات التي يعتمدها الموقع.</p>
<p>نشط : إذا تم وضع خيار نعم فيه فهذا يعني أن البلوك يعمل حالياً , هذا الخيار جيد لبعض البلوكات التي بحاجة لأن تعمل دون إظهار واجهة .</p>
<p>أساسي او فرعي: هنا يمكنك إختيار في أي مكان سيظهر البلوك .</p>
<p>ترتيبه من أعلى : اختر القيمة التنازلي التي سيحملها مكان البلوك في نفس العامود و سيظهر البلوك للزائر في هذا المكان بالتحديد, لا تقم باعطاء أكثر من بلوك لنفس القيمة لتجنب الإلتباس.</p>
<p>الترخيص: من هنا يمكنك إدخال ترخيص دعم فني مخصص لبلوك ما و تعديله.</p>
<p>حذف : يمكنك حذف البلوك فلا يظهر في الموقع, و يذهب الى سلة المحزوفات, و يمكنك من هناك استعادته او حذفه بشكل نهائي, الحذف هنا الذي نتكلم عنه هو حذف للتفعيل و ليس للملفات , اذا اردت حذف الملفات فيمكنك ذلك من خلال أيقونة ملفات الموقع في الصفحة الرئيسية لمدير الموقع.</p>