<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>الإعلانات</strong></p>
<p>يتمتع
  مستخدموا phpTransformer بنظام اعلانات مميز, حيث يمكنهم انشاء حملات اعلانية بتاواريخ محددة و يتم الدفع باحتسابا النقرات او عدد مرات الظهور او لفترة زمنية محددة. الاعلانات هذه يتم انشاؤها نصية او صورة او ملف فلاش من خلال لوحة تحكم العضو . كما يجب على المعلنين اخذ موافقة مسبقة في حال قرر المدير ذلك قبل التمكن من نشر الاعلانات.<br />
مواضع الاعلانات يتم تحديدها عبر رقم فريد, مثلا الاعلانات التي ستظهر في بلوك الاعلانات رقمها 1, هذه الارقام يمكن برمجتها لتكن في اي مكان تريده من الموقع فيما بعد.</p>
<p>إن أول ما يجب أن تقوم به هو إنشاء لائحة أسعار بفترة زمنية محددة و تقوم بتفعيل هذه الائحة حتى يتم احتساب كلفة الاعلانات عند الزبائن.<br />
</p>
<p>الزبائن : هم الأعضاء الذين يعلنون على صفحات الموقع, هنا تجد لائحة تضم اسماء الاعضاء و عند الكبس  على اسم العضو تظهر حركة حملاته الاعلانية و حركة المالية كما يمكنك انشاء ايصال قبض له.</p>
<p>مواضع الاعلان : هي الأمكنة التي تظهر فيها الإعلانات و يتم وضع كود برمجي فيها لتظهر فيها هذه الاعلانات بالطول و العرض المدخلين .</p>
<p>لائحة الأسعار : أساس تطبيق الاعلانات و المبدأ في تسعير كافة الاعلانات التي ستظهر خلال الفترة المحددة و سعر الظهور للإعلان و سعر النقر عليه, يجب الإشارة الى ان الاعلانات النصية كلفتها على اساس النقر على الرابط الخاص بها, أما الصور فعلى الظهور طالما لا يوجد فيها رباط اما في حال وجود رابط على الصورة فيتم احتساب النقر, و الاعلانات الفلاشية كلفتها دائما حسب الظهور بسبب احتمال وجود رابط دخلي فيها.</p>