<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>تحديثات<br />
</strong>ليس هناك أسهل من يقوم phpTransformer بتحديث نفسه بنفسه دون العناء التنزيل و الرفع و التاكد من التوافقية, ليس فقط لقلب النظام بل ايضا للبرامج و البلوكات المرفقة و الأشكال أيضا.</p>
<p>يقوم phpTransformer بتفقد وجود تحديثات كل يوم , لكنك تستطيع التفقد بأي وقت تشاء عبر كبس زر إجراء فحص جديد.<br />
عند كبس هذا الزر تظهر لك صفحة جديدة و فيها خطوات الفحص.</p>
<p>بعد الانتهاء يمكنك كبس الرابط اكتمال التحديث لترجع الى الصفحة الئيسية حيث يظهر زر جديد &quot; قم بالترقية الآن &quot; عند كبسه تجري عملية التحديث بشكل تلقائي للذين يتمتعون بترخيص للدعم الفني, أما الباقي فيمكنهم ذلك عبر تنزيل البرنامج من رابط عبر موقع sourceforge.net .</p>
