<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>تنصيب<br />
</strong>إن أي برنامج أو بلوك أو شكل أو لغة لا يمكن أن يستعملها الزائر في الموقع الا بعد تفعيلها و تنصيبها لذلك تم وضع هذه الايقون لتسهل الوصول الى هذه المكونات.</p>
<p>في الشاشة الرئيسية للتنصيب ستجد أيقونات لـ برنامج جديد , بلوك جديد, أشكال الموقع, اللغات , عند اختيارك لأي منهم سوف تتحول الى صفحة تفعيل هذا العنصر.</p>
<p>برنامج جديد : البرامج موجود ضمن المجلد Programs/ كل برنامج يأخذ اسم مجلد فريد لذلك سيتم هنا عرض البرامج الموجودة و التي لم يسبق تفعيلها من قبل, ستجد هنا أيقونة للبرنامج و رابط تفعيل البرنامج مع اسمه و رقم اصداره, تحته ايضا ستجد معلومات عن مطور هذا البرنامج و شرح بسيط له.<br />
</p>
<p>بلوك جديد : البرامج موجود ضمن المجلد Blocks/ كل بلوك يأخذ اسم مجلد فريد لذلك سيتم هنا عرض البلوكات الموجودة و التي لم يسبق تفعيلها من قبل, ستجد هنا أيقونة للبلوك و رابط تفعيل له مع اسمه و رقم اصداره, تحته ايضا ستجد معلومات عن مطور هذا البرنامج و شرح بسيط له.</p>
<p>أشكال الموقع : تتوزع الاشكال في المجلد /Themes للواجهة الرئيسية للمستخدم و داخل المجلد admin/Themes لواجهة المدير و داخل كل بلوك أو برنامج تحت المجلد الفرعي /Themes ايضاً , الشكل الكامل يتحوي كل هذه العناصر.<br />
في هذه الشاشة ستجد صورة مصغرى للشكل و تحته رابط تفعيل الشكل مع اسمه, و في الاسفل ستجد معلومات عن هذا الشكل مثل اسمه و عنوان موقعه الرسمي و شرح بسيط عنه و المصمم له و بعض الكلمات المفتاحية عنه.</p>
<p>اللغات : يتم استعراض اللغات الموجودة و الغير مفعلة من قبل داخل لائحة منسدلة و بعدها زر تنصيب عند كبسه سيكون الموقع و جميع مكوناته متوفرة بهذه اللغة, ملفات اللغة تكون منتشرة دخل phpTransformer بمجلد باسم languages  للواجهة الرئيسية و لواجهة المدير و لكل بلوك و برنامج و حتى بعض الاشكال, يجب أن تنتبه لموضوع ان اعمالك السابقة بعد تفعيل اللغة الجديدة يجب أن تقوم بترجمتها لهذه اللغة حتى لا تظهر رسالة عدم توفرها للزائر بهذه اللغة.</p>
