<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>شريط الأخبار<br />
  </strong>باستطاعة المدير  تمرير الأخبار عبر شريط خاص مستمداً المعلومات من برنامج الأخبار أو عبر الإدخال  اليدوي المباشر.
</p>
<p>من هنا يمكنك إستعرضا أشرطة الاخبار التي تم توليدها من قبل برنامج الأخبار بشكل اوتوماتيكي, أو التي تم إدخالها يدوياً, كما يمكنك القيام بعمليات الإضافة و التعديل والحذف.</p>
<p>نص الخبر: هو النص الذي سيظهر للزائر في المستعرض.</p>
<p>الرابط: هو العنوان الذي سيتم تحويل الزائر اليه, في حال عدم وجود رابط (قيمة الرباط ستكون فراغ واحد space bar)سيظهر الخبر دون القدرة على التحويل. في حال كان الرابط داخلي من الافضل نزع اسم الموقع و مجلد الذي يعمل منه phptransformer و كذلك الامر قيمة اللغة.</p>
<p>ترايخ بدء النشر: هو التاريخ الذي منه سيقوم phpTransformer ببث هذا الخبر في الشريط, اذا كان التاريخ صفر فسيتم بثه فوراً .</p>
<p>تاريخ نهاية النشر: هو التاريخ الذي سيتوقف فيه البث, في حال كان التاريخ صفر فهذا يعني ان هذا الخبر سيتم بثه دون توقف.</p>
<p>إضافة و تعديل : عند حالة الإضافة او التعديل هناكل خيار &quot;

لا يوجد تاريخ محدد &quot; إذا تم انتقاؤه فسيتم فبذلك تصفير تاريخ البدء و الانتهاء.</p>
<p>الحذف: عند كبسك للحذف ستظهر لك رسالة تأكيد و من ثم سيتم نقل شريط الخبر هذا الى سلة المحذوفات حيث يمكنك استعادته أو حذفه بشكل نهائي.</p>