<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>أذونات خاصة<br />
</strong>بعض المبرمجين قد يحتاج لتطبيق صلاحية وصول على جزء معين من برنامجه, على سبيل المثال اذا طبقت صلاحية وصول لبرنامج الصفحات على أن يستطيع الجميع تصفحه لكن تريد لصفحة معين أن يتم الوصول اليها لمجموعة محددة يمكنك من هنا تطبيق ذلك بسهولة.</p>
<p>عندما يكون هناك خيار نعم فهذا يعني أن هذا العنصر من هذا البرنامج او البلوك سيمكن أعضاء المجموعة المحددة من الوصول اليه و رؤية محتواه.</p>