<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>الإتصال بنا </strong></p>
<p>&nbsp;</p>
<p>يوفر phpTransformer ميزة التواصل بين الزوار و ادارة المواقع عبر البريد الإلكتروني و من دون المخاطرة بعرض عنوان البريد للعموم و ذلك تفادياً لرسائل السبام المزعجة من مجهولين. </p>
<p>يتم ترتيب الاتصال عبر مكاتب , كل مكتب هو عبارة موضوع للتواصل مثل التسويق , الشكاوى, الدعم الفني و غيره.<br />
هذه المكاتب يمكن إنشاؤها و حذفها و تعديل اسمها حسب اللغات التي يدعمها الموقع .</p>