<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>الأعضاء<br />
  </strong> من هنا يمكنك إدارة أعضا موقع مثل اضافة عضو جديد أو حذف أو طرد أو بحث عن عضو ما أو تغيير كلمة سر أحدهم.
</p>
<p>الأعضاء أو المستخدمين , هم الزوار الذين قاموا بالتسجيل في الموقع و حصولا على عضوية و تكون لهم عادة امتيازات افضل من الزوار العاديين, كما يمكن ترقية العضو الى مدير للموقع فيما بعد.<br />
  في هذه الشاشة يمكنك استعراض الأعضاء و عند وجود عدد كبير منهم نتيجة البحث سيتم تقسيمهم على صفحات عدة مرقمة.
</p>
<p>مستخدم جديد : <br />
من المفترض أن يقوم الزائر بتسجيل نفسه على هناك بعض الحالات التي يريد فيها المدير تسجيل عضو جديد بنفسه كأن يقوم بانشاء اكثر من حساب لنفسه, من هنا يمكنه كتابة اسمه و عائلته و &quot;اسم العضو&quot; 	Nickname الذي سوف يستخدمه العضو في تسجيل دخوله , هذا الاسم هو اسم فريد لا يمكن تكراره في الموقع ابداً . البريد الالكتروني ايضا لا يمكن استخدام نفس البريد لعضوين او اكثر, كلمة السر يتم تشفيرها في قاعدة البيانات من بعد تأكيدها في خانة &quot; كلمة سر من جديد &quot; و كبس زر حفظ.</p>
<p>حذف مستخدم :<br />
  لسبب ما قد يضطر المدير الى حذف عضو ما من الموقع , هذه الخطوة خطيرة لذلك عند حذف العضو يتم تحويله الى &quot; سلة المحذوفات &quot;
حيث يمكنك إستعادته أو حذفه بشكل نهائي.</p>
<p>طرد مستخدم: <br />
الفرق بين الطرد و الحذف أن الحذف سيتم بشكل نهائي و يمكن لهذا العضو التسجيل من جديد بنفس القيم السابقة, لكن الطرد سيظل هذا العضو مسجلا لكن لن يتمكن من المشاركة في الموقع أبداً.</p>
<p>بحث عن مستخدم:<br />
  عندم بحثك عن عضو ما سيظهر لك رسالة في حال عدم وجوده تفيد ذلك أو سيظهر لك معلومات العضو مثل اسمه و تاريخ تسجيله و اسم العضو و بريده الإلكتروني و بلده , حيث يمكنك تعديل هذه المعلومات أو حذف هذا العضو.
    <br />
    كما يمكن البحث دون تحديد قيمة فسيظهر لك لائحة بكل أعضاء الموقع مقسمين على صفحات مرقمة.
</p>
<p>&nbsp;</p>
