<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong><br />
 المدراء : </strong><br />
المدراء هم المجموعة التي يسمح لها بإدارة الموقع, يوجد هناك مدير له صلاحيات مطلقة يكون هادة هو اول مدير للموقع يطلق عليه تسمية &quot;آدم&quot; و باقي المدارء يمكن تحديد صلاحيات وصولهم لأجزاء معينة من الموقع كما يمكن اضافة عضو الى لائحة المدارة كما يمكن إيقاف مدير لفترة ما و حذفه ايضا.</p>
<p>مدير جديد: <br />
فقط الأعضاء ضمن المجموعة المسماة Admins يسمح لهم ان يديروا الموقع , لذلك عند جعل العضو مدير يتم وضع بشكل افتراضي ضمن هذه المجموعة , أيضا لا يمكنك وضع اسم عضو عشوائي, يجب أن يكون عضواً فعلاً بالموقع.</p>
<p>إستعراض المدراء:<br />
ان الاعضاء الذين سبق لهم أن ضموا الى المجموعة Admins ستجدهم هنا, فكل مدير ستجد صورته الرمزةي و تحتها اسم العضو و إذا كان المدير &quot;آدم&quot;
  يعني له الصلاحيات المطلقة فستجد قبل اسمه صورة درع صغيرة جدا, و تحت اسم العضو إسمه الثلاثي و تحتها حالة المدير هذا اذا كان فعلاً أو تم إيقافه.<br />
عند كبس الصورة الرمزية او اسم العضو فسيتم تحويلك الى صفحة صلاحيات هذا المدير.</p>
<p>صفحة صلاحيات الوصول للمدير :<br />
  تم وضع في هذه الصفحة أمرين لإنتقاء كل الصلاحيات و آخر لعدم انتقاء شي اتسهيل الانتقاء بشكل كبير. <br />
  وحده المدير &quot;آدم&quot; يمكن جعل مدير آخر &quot; آدم &quot;
بدلاً عنه كما انه هو الوحيد الذي له صلاحية ايقاف مدير آخر. أما باقي المدراء اذا تم وضع صلاحية لهم بالوصول الى هذه الصفحة فيمكنهم تعديل صلاحياتهم و صلاحيات المديرين الآخرين.<br />
الصلاحيات هنا تم تجميعها حسب عناصر لوحة تحكم المدير و حسب البرامج و البولكات, أيضا ضمن نفس البرنامج أو البلوك ستجد تحته عناصر البرنامج التي قام بإضافة امكانية وضع صلاحيات المبرمج المطور لها.<br />
عند كبس زر الحفظ سيتم تطبيق الصلاحيات فورا و المدير الذي يعمل الان عند تحديثه للشاشة التي يعمل عليها أو زيارته لشاشة جديدة سيجد أن الصلاحيات قد طبقت.</p>