<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong><br />
  اللغات : <br />
</strong>إن البنية الأساسية التي قام عليها phpTransformer هي دعمه لتعدد اللغات ليس لشكل الموقع فقط بل لمضمونها أيضا فكل صفحة فيه يمكنك استعراضها بأكثر من لغة دون الحاجة للذهاب الى موقع آخر بلغة أخرى, ملفات اللغة هذه يمكن تفعيلها و حذفها و على هذا الاساس فإن اي برنامج سيظهر بلغة ما للزائر سيمون إعتماده على هذه الأيقونة.</p>
<p>اللغة : اسم اللغة بالحروف اللاتينية من أجل دعم أوسع نطاق بأنظمة التشغيل.</p>
<p>اختيارات هذه اللغة: عدد المرات التي استعرض به الموقع بهذه اللغة.</p>
<p>محذوف : حالة الحذف , اذا كانت نعم فيمكنك استعادتها من سلة المحذوفات, أو حذفها نهائيا, الحذف هنا الذي نتكلم عنه هو حذف التفعيل للغة و ليس حذف ملفات اللغة من الموقع نهائيا, يمكنك الحذف النهائي من أيقونة &quot; ملفات الموقع &quot; , تم وضع الحالة هنا كي لا يصاب مدير الموقع بارتباك لتنصيبه لغة جديدة.</p>
<p>لغة جديدة : من هنا يمكنك تفعيل استخدام لغة جديدة في الموقع, في حال كنت قد بدأت العمل بالموقع من قبل بلغات أخرى , عليك الان ان تدخل بيانات الصفحات و الاخبار و المعرض و غيرها من معلومات بهذه اللغة و الا سوف تظهر للزائر رسالة تفيد بان الصفحة الملطلوبة غير متوفرة بهذه اللغة,<br />
  لذلك نحن ننصح بوضع استراتيجية للغات التي يمكن ان يعتمدها الموقع من اول الطريق.<br />
في حال لم تكن ملفات اللغة موجودة يمكنك رفعها عبر &quot; ملفات الموقع&quot; , أما التحديثات فستجلب معها اللغات الرسمية المعتمدة من phpTransformer .</p>
