<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>ترجمات<br />
    </strong> إن واجهة البرنامج يمكن ترجمتها حسب اللغة المحلية لك, كما يمكن تعديل الألفاظ لتتلائم مع طبيعة موقعك, على سبيل المثال رسالة إستقبال الزائر من الممكن أن تكون &quot;مرحبا &quot; أو &quot;مرحبا بك أيها العضو&quot; أو &quot;نرحب بك جانب الدكتور&quot; لذلك أقمنا جانب للترجمة سهل للغاية فيه تستطيع تعديل الترجمات و إضافة ترجمة جديدة كليا, كما يمكنك وضع ترجمة خاصة بك لا يتم اكتابة فوقها في حال تحديث الموقع , أيضا يمكنك مشاركة ترجماتك مع من تحب حتى تنتشر هذه اللغة بين مستخدمي phpTransformer مع الاحتفاظ بكامل حقك كمالك لعملك هذا.</li>
</p>
<p>&nbsp;</p>
<p>ترجم الآن ! :<br />
  يمكنك البدء بترجمة phpTransformer للغتك المحلية أو للغة تجيدها غير متوفرة حاليا, الترجمة تكون لواجهة المستخدم و لواجهة المدير من ضمن كل واحدة هناك ايضا ترجمات للبرامج و البلوكات.<br />
  عند اختيارك لما تريد ترجمته ستظهر لك شاشة جديدة :<br />
  اللغة المصدر: هي اللغة التي تعرفها و متوفر حاليا في الموقع, عبارات هذه اللغة ستظهر لك عند بدء اللترجمة لتستفيد منها.<br />
  ترجمة قياسية أو مخصصة: عند تطوير phpTransformer أخذنا بعين الاعتبار ان ترجمتنا نحن قد لا تكون مناسبة لموقع ما لذلك سمحنا له بانشاء ترجمة خاصة به &quot;مخصص&quot;
  لا يتم الكتابة فوقها عند التحديث و الموقع حينما يجد ترجمة مخصصة سيتجاهل القياسية.<br />
  لكن في حالة كنت تريد المساهمة في تطوير phpTransformer فيمكنك البدء بترجمة قياسية و ارسالها لنا مع فائق التقدير لمجهودك فنحن نحفظ حقوقك كمالك لهذه الترجمة.<br />
  اللغة الجديدة : هي اللغة التي سوف تستحدث , اسم هذه اللغة يجب أن يكون لاتينيا كي يتم دعمها في اوسع عدد من الخوادم حول العالم.<br />
عند كبس زر أرسل سوف تظهر شاشة جديدة , في أعلاها ستجد اللغة المصدر و اللغة الجديدة و اسفلها اسم الملف الذي سيجري الكتابة فيه, و بعدها جدول فيها كل متغير للغة و نصه باللغة المصدر و تحته خانة يمكنك كتابة ترجمتك فيها.</p>
<p>تحرير الترجمات:<br />
  الترجمات التي تظهر هنا هي الترجمات التي سبق و أن تم اعتمادها من قبل, ستجد في هذه الشاشة عامودين اثنين واحد لواجهة المستخدم و آخر للمدير و في كل واحد من هذه الاعمدة هناك الترجمة الاساسية و ترجمات البرامج و البولكات.<br />
بعد اختيارك لما تريد تحريره من ترجمة, ستظهر لك شاشة جديدة فيها اسم الملف الذي سيتم الكتابة فوقه, و تحته اسم المتغير و خانة تستطيع فيه تعديل الترجمة و حفظها.</p>
<p>مشاركة ترجمة :<br />
  إن مبدا البرمجيات الحرة المفتوحة المصدر قائم على المشاركة بين أطراف المجتمع, لذلك فإن المترجم الذي لا يملك مهارات برمجية سهلنا الامر عليه عبر هذه الشاشة , فبعد انتهائه من الترجمة يمكن مشاركته عبر ضغط جميع الملفات الخاصة بهذه اللغة بملف واحد و يرسل الرابط الخاص به لمن يحب.<br />
كما يمكنه ادارة هذه الملفات عبر &quot; ملفات الموقع &quot; و يتم ادراج كل ملف تمت مشاركته من قبل كما يمكنه من انشاء مشاركة جديدة.<br />
ملاحظة : حتى تتمكن من مشاركة ترجمتك يجب على الاقل أن تكون قد ترجمت الواجهة الرئيسية للمستخدم .</p>