<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
****	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>المجموعات<br />
  </strong> يأتي مع phpTransformer ثلاث مجموعات هي من ضمن النظام لا يمكن حذفها هي مجموعة الزوار Guests و هم الزوار الذين لم يتم تسجيلهم في الموقع و لم يحصلوا على عضوية دائمة, و مجموعة Users و هم الأعضاء بالفعل و يستطيعون تسجيل دخولهم عبر اسم مستخدم و كلمة مرور و مجموعة ثالثة هي مجموعة Admins و هم أعضاء يتمتعون بصلاحية إدارة الموقع. كما يمكنك إنشاء مجموعات تطلق عليها التسمية التي تريد لتطبق عليها فيما بعد الصلاحيات التي تراها مناسبة كما يمكنك حذفها و إبدال أعضاء مجموعة بمجموعة أخرى و إستعراض أعضاء مجموعة ما و تغيير مجموعة عضو معين و تعديل المجموعة.  </p>
<p>مجموعة جديدة : يمكنك وضع اسم للمجموعة بلغتك المحلية و شرح لها حتى تعرف لماذا قمت بإنشاء هذه المجموعة, عند اضافتك لمجموعة جديدة ستظهر ضمن إعطاء الصلاحيات.</p>
<p>حذف مجموعة : لا يمكنك حذف المجموعات الأساسية التي تأتي مع النظام مثل مجموعة Guest Users  و Admins , باقي المجموعات عند حذفهم يتم نقلهم الى سلة المحذوفات حيث يمكنك استرجاعهم و حذفهم بشكل نهائي.</p>
<p>إبدال مجموعة بمجموعة : قبل حذفك للمجموعة يجب أولاً ان تقوم بخطوة نقل أعضاء هذه المجموعة الى مجموعة أخرى كي لا تفقد الصلاحيات.</p>
<p>أعضاء المجموعة : من هنا يمكن استعراض اعضاء مجموعة ما.</p>
<p>تغيير مجموعة عضو: مهما كان انتماء العضو يمكنك نقله الى مجموعة أخرى, مع العلم أن المدير عند نقله من المجموعة Admins سفقد صلاحية وصوله الى لوحة تحكم المدراء .</p>
<p>تعديل مجموعة : من هنا يمكنك تعديل اسم و شرح المجموعة .</p>
<p>&nbsp;</p>