<?php
/***********************************************
*
*	Project: phpTransformer.com .
*	File Location :  .
*	File Name:  .
*	Date Created: 00-00-2007.
*	Last Modified: 00-00-2007.
*	Descriptions:	.
*	Changes:	.
*	TODO:	 .
*	Author: Mohsen Mousawi mhndm@phptransformer.com .
*
***********************************************/
?>
<p><strong>سلة المحذوفات<br />
  </strong>لأن المعلومات قيمة جداً بالنسبة لنا و نعتبرها أهم شيء يمكن فقدانه, قمنا بإدراج سلة محذوفات لمعظم مكونات الموقع يمكنك منها إستعادة المعلومة أو حذفها بشكل نهائي و أعتقد أن phpTransformer هو أول برنامج إدارة مواقع يفعل ذلك.
</p>
<p>على اليمين ستجد كافة مكونات phpTransformer التي تدعم خاصية سلة المحذوفات و عندما تختار احداها سيعرض على اليسار العناصر المحذوفة حيث يمكنك حذفها بشكل نهائي او استعادتها من جديد الى العمل.</p>